[
    {
        "image": [
            "https://www.joyousapron.com/wp-content/uploads/2021/03/Mee-Goreng-Sq-2.jpg"
        ],
        "price": "120",
        "category": "Asian",
        "title": "Mee Goreng (Fried Noodles Indian-Style)",
        "ingredients": [
            "5, oz Oil noodles or spaghetti",
            "2 ,tb Oil",
            "4 oz Peeled prawns or skinless boned chicken; diced meat",
            "1, sm Onion; chopped",
            "4, oz Cabbage; sliced",
            "1 ,sm Tomato; sliced",
            "1. 4, inch piece celery; chopped",
            "2, Cloves garlic; crushed",
            "1, Chilli; crushed",
            "1/2 ,Boiled potato; diced",
            "1, Egg; beaten",
            "1, tb Tomato ketchup",
            "2, tb Soy sauce",
            "1/4 ,ts Salt",
            "1/2 ,ts Sugar",
            "4 ,oz Beansprouts",
            "1 ,Lemon; juice of",
            "2, Sprigs coriander; chopped, up to 3"
        ],
        "servings": 1,
        "instructions": "If using spaghetti, cook it in boiling water until just tender, then drain and toss in a tablespoon of olive oil to stop it sticking together. No need to prepare the oil noodles. Heat the oil in a wok or frying pan and fry the garlic, onion, cabbage, celery, potato and prawns or chicken. Add the noodles and stir fry for 10 minutes more. Make a gap in the centre of the noodles and add the egg. Stir it in to scramble it. Add the chilli, tomato, tomato ketchup, soy sauce, salt and sugar. Stir well. Just before transferring to a plate, add the beansprouts and stir for about 30 seconds. Sprinkle with lemon juice and chopped coriander to serve."
    },
    {
        "image": [
            "https://cdn.tarladalal.com/members/9306/big/big_chapati_rolls_stuffed_with_spicy_potatoes-16861.jpg"
        ],
        "price": "200",
        "title": "Chapati with Spicy Potato Filling (Indian)",
        "category": "Asian",
        "ingredients": [
            "1 ,tb Oil",
            "2 ,Onions",
            "1 ,Dessertspoon ground chillies",
            "2, Potatoes, mashed",
            "1, md Carrot, grated",
            "1 ,ts Salt",
            "1, Stalk spring onion, chopped",
            "1 ,Sprig coriander leaves",
            "500 g ,Wholemeal flour (atta)",
            "1 1/2 ,c Water",
            "1/2, ts Salt",
            "3, tb Ghee"
        ],
        "servings": "16 Chapatis",
        "instructions": "Heat oil and lightly brown onions. Add chillies, mashed potatoes, grated carrot, salt and chopped spring onion and coriander leaves. Mix well. Remove from heat and allow to cool. Put wholemeal flour into a mixing bowl with salt. Mix into a firm ball of dough by adding water a little at a time. Spread 1 tablespoon of ghee on the dough and continue kneading. Repeat with another tablespoon of ghee. Lastly spread the last tablespoon of ghee onto the lump of dough and allow to stand for 30 minutes. Divide into small balls of dough. Flatten dough with the palm of your hands. Dip both sides into a little flour. Place chapati on a wooden board and roll out with a rolling pin. Brush with a little ghee and spread 1 tablespoon of spicy potato filling evenly on surface. Fold into half and then fold again to seal filling. Dip again into flour and roll out again into a thin square of chapati. Place chapati onto a flat pan over medium heat and brown both sides. Brush chapati with ghee on both sides while frying. Serve with your favourite curry, dhal or plain yoghurt."
    },
    {
        "image": [
            "https://www.beyondthechickencoop.com/wp-content/uploads/2021/06/Grilled-Flatbread.jpg"
        ],
        "price": "180",
        "title": "Indian Griddle Fried Flat Bread",
        "category": "Asian",
        "ingredients": [
            "3, c Whole wheat flour",
            "1 ,ts Salt",
            "1, c Water",
            "1 ,tb Ghee",
            "Yield - 20-24 Chipati"
        ],
        "servings": "4 Servings",
        "instructions": "Sift flour and salt together in a bowl. Make a well in the center and add ghee and water. Knead 10 minutes to make a pliable dough, form into a ball, cover and allow to rest at least 1 hour, or over night. Divide dough into 20-24 portions. Roll into 6 inch circles and allow to rest 5 minutes. Heat griddle or cast iron fry pan very hot. Place a chipati on the griddle or fry pan, fry for 1 minute. Flip over and fry for 1 minute."
    },
    {
        "image": [
            "https://everydangdish.com/wp-content/uploads/2020/05/Gujarati-Indian-Potatoes12.jpg"
        ],
        "price": "150",
        "title": "Gujarati Potatoes Indian",
        "category": "Asian",
        "ingredients": [
            "1 lb Potatoes, waxy type",
            "5 tb Olive oil",
            "3 lg Garlic cloves",
            "1/2 ts Ground turmeric",
            "1/8 ts Ground asafoetida",
            "1 ts Salt",
            "1 pn [generous]cayenne pepper or hot powder",
            "1 tb Sesame seed"
        ],
        "servings": "4 Servings",
        "instructions": "Sesame seed - I used pre-roasted from a Chinese grocery Gujarat is a part of India on the western coast, right at the Tropic of Cancer, between 20 and 25 deg. N. latitude. This recipe, adapted from Madhur Jaffrey, uses only one \"mystery ingredient,\" asafoetida powder (you should find some if you're going to get into Indian cooking at all.) Jaffrey says use two pounds of medium, very waxy boiling potatoes. I used one pound but left everything else the same and it was perfect for two hungry people. Peel potatoes (optional) and cut into long French-fries 3/8\" (9mm) square. Dunk in a bowl of cold water for 1/2 hour. Peel and sliver garlic. Heat the oil in a 9- or 10-inch skillet over medium. Drain and pat dry the potato fingers. Put potatoes in hot oil and turn occasionally for 8 or 10 minutes to partially cook -- not brown. Remove potatoes with tongs or slotted spoon to a plate with a paper towel on it. From here on you have to move kind of fast: throw the sesame seeds into the skillet, stir once. Add the garlic, and continue to stir. When it =just= begins to turn brown, quickly add turmeric and asafoetida, and stir once more. After just a couple of seconds put the potatoes back in, with salt and cayenne or hot powder. Reduce heat and cook gently until done. Stir frequently. (I added a tiny bit of water and loosely covered the skillet with a plate during the last few minutes.)"
    },
    {
        "image": [
            "https://media.istockphoto.com/id/878180648/photo/desi-pure-ghee-or-clarified-butter-in-glass-or-copper-container-with-spoon-selective-focus.jpg?s=612x612&w=0&k=20&c=gkjFRt3nwUbnK-bB3108rtN6pLrHA_nGDlRCm_ZI2l0="
        ],
        "price": "220",
        "title": "Ghee (Indian Butter Oil)",
        "category": "Asian",
        "ingredients": [
            "2 lb Butter, unsalted"
        ],
        "servings": "3 Cups",
        "instructions": "Divide butter into 1/4 pound pieces. In heavy 5 qt. saucepan, heat butter over moderate heat, stirring to melt slowly and completely without letting it brown. When completely melted, increase heat and bring the butter to a boil. When the surface is completely covered with white foam, stir the butter gently and reduce heat to the lowest possible point. Simmer uncovered and undisturbed for 45 minutes, or until the milk solids on the bottom of the pan are golden brown and the butter on top is transparent. Slowly pour the ghee through a linen towel or 4 layers of moistened cheesecloth. If the are any solids, no matter how small, strain again to prevent oil from becoming rancid later. The ghee must be perfectly clear. Pour the ghee into a jar or crock, cover tightly and store in refrigerator or at room temperature until ready to use. Ghee will solidify when it is chilled. If may be safely kept at room temperature for 2 or 3 months. NOTES: Although ghee resembles clarified butter, the long low heat cooking imparts a distinctive nutlike flavor that cannot be duplicated."
    },
    {
        "image": [
            "https://jehancancook.com/wp-content/uploads/2011/12/IMG_0585-1440x1067.jpg"
        ],
        "title": "Christmas Cake West Indian Style",
        "category": "Asian",
        "ingredients": [
            "--Fruit Mixture---",
            "1 c Raisins",
            "1 c Currants",
            "1/2 c Candied cherries",
            "1/2 c Candied citrus peel",
            "1 c Mixed dried fruit",
            "1 c Rum",
            "1 c Sweet sherry or port wine --Cake---",
            "1/2 lb Butter; at room temperature",
            "1/2 c Brown sugar",
            "4 Eggs",
            "2 c Flour",
            "1 ts Baking powder",
            "1 ts Ground ginger",
            "1 ts Ground nutmeg",
            "3 ts Ground cinnamon",
            "1/2 ts Ground cloves",
            "1/2 ts Ground allspice",
            "2 1/2 ts Lemon essence",
            "2 1/2 ts Almond essence",
            "1 ts Vanilla essence",
            "1/4 c Brown food coloring; up to 1/2 cup",
            "1/2 c Rum",
            "Additional rum for basting during storage"
        ],
        "servings": "1 Servings",
        "instructions": "Fruit Mixture: Mix together all the ingredients and store in a tightly sealed jar for at least 1 month The Cake: Prepare a 10\" deep round cake baking tin or a 13\" x 9\" baking tin by lining it with two layers of waxed paper, greasing between the layers. Preheat the oven to 250 degrees. In a large bowl, cream together the butter and sugar until they are light and fluffy. Add the eggs, one at a time, mixing well after each addition. Sift the flour, baking powder and all the dry spices together. Add the lemon essence, almond essence and vanilla essence to the fruit mixture. By hand, stir tablespoonsful of the flour mixture and the fruit mixture alternately into the butter, sugar and egg mixture. Add the browning gradually, stirring until a deepish brown colour is reached. Turn the cake mixture into the baking tin, smooth the top and bake in the oven for 3-4 hours or until a skewer or wooden toothpick, inserted, comes out clean. This can take an additional hour or two. Remove the cake from the oven, prick it all over with a skewer or toothpick and pour the rum all over it. Remove the cake from the tin when it is cool, wrap it tightly in waxed paper, place it in an airtight container and leave for a month for best flavour. Every week, prick the cake with a skewer and pour on about 1 tablespoon of rum. (Makes one 5 pound cake. ) Serve with Hard Rum Sauce. Full recipe name is Laurel-Ann's Wedding Cake or Christmas Cake West Indian Style"
    },
    {
        "image": [
            "https://1.bp.blogspot.com/-HjpyGGuSZ9E/XuPDiipt4II/AAAAAAAAQ68/QR2c_6aN-wgTTGZv8mTUjFiLIHL-d45lACNcBGAsYHQ/w1200-h630-p-k-no-nu/Sothi%2BKuzhambu.JPG"
        ],
        "price": "300",
        "title": "Sothi (South Indian)",
        "category": "Asian",
        "ingredients": [
            "1 c Thick coconut milk",
            "2 1/2 c Thin coconut milk",
            "1 Onion, ground",
            "3 Cloves garlic, ground",
            "2 1/2 Cm ginger, ground",
            "1 Onion, cut into wedges",
            "2 Sprigs curry leaves",
            "1 ts Turmeric powder",
            "1/4 ts Fenugreek",
            "2 ts Salt",
            "2 Potatoes, cut into wedges",
            "150 g Okra, kept whole",
            "150 g French beans, cut into two",
            "4 Cabbage leaves, cut into",
            "Squares",
            "3 Red chillies, coarsely",
            "Sliced",
            "3 Green chillies, coarsely",
            "Sliced",
            "2 Tomatoes, quartered",
            "1 tb Lime juice"
        ],
        "servings": "4 Servings",
        "instructions": "Put thin coconut milk in a cooking pot. Add \"A\" and bring to a slow boil. When vegetables are half-cooked, add tomatoes. Simmer till vegetables are soft, stirring occasionally. Add thick coconut milk, gently stirring to prevent curdling. When curry boils again, add lime juice and remove from heat. Serve with rice."
    },
    {
        "image": [
            "https://static.emerils.com/Calzone%20for%20web.jpg"
        ],
        "price": "280",
        "title": "Fresh Mozzarella, Italian Sausage and Roasted Pepper Calzon",
        "category": "Italian",
        "ingredients": [
            "1 Ball of basic pizza dough (enough dough for 1 pizza)",
            "1 tb Olive oil",
            "Salt and white pepper",
            "1/2 c Thick pesto",
            "1/2 c Roasted garlic",
            "1 c Diced Italian sausage, cooked",
            "1 Red pepper, roasted, peeled, seeded and julienned",
            "2 tb Chiffonade of basil",
            "4 sl (1/2-inch) fresh Mozzarella cheese",
            "1 Egg, beaten",
            "1 c Spicy tomato sauce, hot",
            "2 tb Grated Parmigiano-Reggiano cheese",
            "1 tb Chopped chives",
            "1 tb Brunoise red peppers"
        ],
        "servings": "2 Servings",
        "instructions": "Preheat the oven to 500 degrees. Place the dough out onto a floured surface. Roll the dough out to form a 12-inch circle. Spread the pesto over one half of the dough. Layer the garlic, sausage, peppe rs, and basil, alternately over the pesto. Lay the Mozzarella cheese over the basil. Fold the other side of the dough over the filling and pinch the edges to seal the calzone. Make three slashes acro ss the top of the calzone. Place the calzone on a parchment-lined baking sheet. Brush the calzone with the egg wash. Bake for 20 to 25 minutes or until golden. Spoon the sauce in the center of the pl ate. Slice the calzone in half and place in the center of the sauce. Garnish with the grated cheese, chives and brunoise peppers."
    },
    {
        "image": [
            "https://kfoods.com/images1/newrecipeicon/italian-style-chicken-breasts_2964.jpg"
        ],
        "price": "220",
        "title": "Microwave Chicken Breasts Italian",
        "category": "Italian",
        "ingredients": [
            "2 tb Olive oil",
            "1 md Onion",
            "1/2 Green pepper; chopped",
            "1/2 ts Oregano",
            "Salt and pepper; to taste",
            "Cayenne pepper; to taste",
            "1/2 Tes capers; drained",
            "1 pn Sugar",
            "1 1/2 ts Balsamic vinegar",
            "4 Chicken breasts without skin"
        ],
        "servings": "4 servings",
        "instructions": "1. Heat 1 1/2 tablespoons oil in a skillet with onion and pepper. Cook until softened, about 5 minutes. Add oregano, salt, black and cayenne peppers, capers and sugar. Cook as additional 2 minutes. 2. Transfer contents of skillet to a food processor and puree. Add remaining oil and balsamic. Taste and correct seasoning. (Recipe can be done ahead to this point) 3. Place chicken breasts in a microwave-oven proof dish or pie plate large enough to hold them in a single layer. Pour sauce over the chicken, cover the casserole loosely with waxed paper and cook on high power for 4 minutes. Turn the chicken, recover and cook an additional 4 minutes or until the chicken is cooked through but still juicy. Partially rotate the dish after 2, 4 and 6 minutes. Set aside for 2 minutes. 4. Spoon 1 or 2 chicken breasts and sauce onto heated plates. Serve with rice or steamed potatoes. NOTES : My MC II shows 28.4 CFF"
    },
    {
        "image": [
            "https://static.onecms.io/wp-content/uploads/sites/19/2004/07/07/chicken-herb-rs-663029-x.jpg"
        ],
        "price": "280",
        "title": "Chicken with Italian Herbs and Vegetables",
        "category": "Italian",
        "ingredients": [
            "6 Chicken breasts; boneless and skinless",
            "1/2 c White mushrooms; sliced 1/8\" thick",
            "1/2 c Red bell pepper sliced 1/8 \"",
            "1/2 c Green bell pepper sliced 1/8\"",
            "1/2 c Onion; sliced 1/8\"",
            "1 Clove fresh garlic; finely chopped",
            "1 ts Oregano; dried",
            "1 ts Basil; dried",
            "1 ts Salt",
            "1/2 ts Black pepper",
            "Canola oil as needed"
        ],
        "servings": "1 Servings",
        "instructions": "Flatten the chicken breasts between 2 sheets of plastic wrap with a mallet or heavy, flat-bottomed saucepan or skillet. Breasts should be a uniform thickness of about 1/2\". Rub the oregano, basil, salt and black pepper into the meat and then brush lightly with canola oil. Brush both sides of the Grilling Machine with oil and allow to pre-heat about 5 minutes. Mix all the vegetables together. Place veggies on the Grilling Machine, spread them out, and cover with the chicken. Grill for 7-8 minutes. Serves 6."
    },
    {
        "image": [
            "https://upload.wikimedia.org/wikipedia/commons/2/2c/Buona_Chicago%27s_Original_Italian_Beef.jpg"
        ],
        "price": "240",
        "title": "Chicago Italian Beef Sandwiches",
        "category": "Italian",
        "ingredients": [
            "2 lb Beef roast, leftover,",
            "Pre-roasted",
            "Roasting pan drippings",
            "2 tb Fresh oregano, finely",
            "Chopped",
            "OR 2 teaspoon dried",
            "Oregano, crushed",
            "1 tb Fresh sweet basil,",
            "Finely chopped",
            "OR 1 teaspoon dried",
            "Basil, crushed",
            "1 ts Whole black peppercorns",
            "1/2 ts Red pepper, ground (1/2",
            "To 1)",
            "1 tb Fresh parsley, minced",
            "Salt, to taste",
            "3 cl Garlic, minced",
            "1 Fresh green pepper seeded",
            "And",
            "sl Into 1/4 inch strips"
        ],
        "servings": "8 Servings",
        "instructions": "Thinly slice cooked, roast beef and place in a Dutch oven (or put it back into the same pan in which the beef was roasted). Add enough water to cover. Add remaining ingredients and bring to simmer. After the beef has cooked for awhile, taste and adjust seasonings. Cook about 1 hour. Serve beef only on Italian bread with grilled green peppers and / or giardinera relish. As you serve dip the sandwich in your gravy."
    },
    {
        "image": [
            "https://oursaltykitchen.com/wp-content/uploads/2020/04/italian-potato-salad-featured-image.jpg"
        ],
        "price": "290",
        "title": "Vlf Italian Potato Salad",
        "category": "Italian",
        "ingredients": [
            "1 lb New red potatoes",
            "1/4 c Water",
            "1 sm Red onion, thinly sliced",
            "x Several sliced ripe black",
            "Olives (optional)",
            "1 sm Cucumber, chopped",
            "1 Tomato, chopped",
            "1/2 c Fat free Italian dressing",
            "2 tb Snipped fresh parsley"
        ],
        "servings": "1 Servings",
        "instructions": "1. Scrub potatoes; cut crosswise into 1/4 in. slices. Place in 1 1/2 qt. microwave safe casserole. Add water. Cover with lid. Microwave on high for 9-10 min. or until potatoes are tender; stirring once. Drain and cool. 2. Add onions, olives, cucumber, tomato, dressing and parsley. Mix lightly to coat evenly. Refrigerate until chilled. Stir before serving."
    },
    {
        "image": [
            "https://posustainableseafood.com/wp-content/uploads/2021/05/ourcatch_montalcino_1500sq-e1629926270701.jpg"
        ],
        "price": "150",
        "title": "Halibut Italiano",
        "category": "Italian",
        "ingredients": [
            "1 1/2 lb Halibut fillets cut into 4 servings",
            "2 c Prepared spaghetti sauce",
            "1/2 c Sliced mushrooms",
            "1/4 c Sliced olives",
            "1/2 c Mozzarella or cheddar cheese",
            "Olive oil"
        ],
        "servings": "1 Servings",
        "instructions": "Place fish in oiled baking pan. Top with mushrooms and olives. Pour spaghetti sauce over the top and bake for 10 minutes at 400o. Remove from oven and sprinkle with cheese. Bake 10 more minutes or until fish flakes easily with a fork. Serve with chopped parsley over the top and a lemon wedge on the side."
    },
    {
        "image": [
            "https://seitanbeatsyourmeat.com/wp-content/uploads/2020/05/chicago-style-giardiniera-recipe.jpg"
        ],
        "price": "180",
        "title": "Giardiniera #5 - Italian",
        "category": "Italian",
        "ingredients": [
            "Fresh chiles of choice",
            "1/2 Part water",
            "1/2 Part vinegar",
            "1 ts Non-idodized salt per pint of liquid",
            "Cauliflower; in flowerets",
            "Broccoli; in flowerets",
            "Carrots; cut in coins",
            "Use baby carrots",
            "Pearl onions",
            "Garlic cloves; whole",
            "Green olives"
        ],
        "servings": "1 Servings",
        "instructions": "\"This basic recipe can be used for pickling chiles either alone or with a combination of other vegetables. Choose the mixture of vegetables desired, the amount and type of chiles, and arrange them attractively in a jar before covering with the pickling solution.\" Wash the chiles and with a toothpick poke several holes near the stem before packing in the jars. Combine the water, vinegar, and salt in a pan and boil for a minute. Pour the hot mixture over the vegetables leaving 1/4 inch head space and cover. Allow the chiles and vegetables to pickle for 2 to 3 weeks before serving."
    },
    {
        "image": [
            "https://thewanderlustkitchen.com/wp-content/uploads/2013/11/Quick-Crockpot-Fondue-square-1200.jpg"
        ],
        "price": "220",
        "title": "Crockpot Fondue Italiano",
        "category": "Italian",
        "ingredients": [
            "1 lb Lean ground beef",
            "8 oz Mozzarella cheese",
            "1 Envelope spaghetti sauce mix",
            "2 15 oz cans tomato sauce",
            "2 tb Cornstarch",
            "1 lb Sharp cheddar cheese",
            "1/2 c Dry red wine"
        ],
        "servings": "1 Servings",
        "instructions": "In a skillet or crock-pot with a browning unit, cook beef until crumbly; pour off excess fat. In the crock- pot, combine beef with dry spaghetti sauce mix, tomato sauce, cheddar and mozzarella cheeses. Cover and cook on low for 2 hours. Dissolve cornstarch in the wine. Turn control to high. Add dissolved cornstarch. Heat on high for 10 to 15 minutes. Dip chunks of Italian bread into the fondue while > keeping the mixture hot in the crock-pot. Makes 6 to 8 serv."
    },
    {
        "image": [
            "https://www.fromvalerieskitchen.com/wordpress/wp-content/uploads/2021/10/Crock-Pot-Italian-Beef-Sandwiches-07.jpg"
        ],
        "price": "300",
        "title": "Crockpot Italian Beef #1",
        "category": "Italian",
        "ingredients": [
            "1 Rump roast; 3-5 lbs",
            "1 pk Good Seasons Italian dressing mix",
            "1 c Water",
            "1 pk Au jus gravy packet",
            "2 ts Italian seasoning",
            "6 Pepperocini peppers"
        ],
        "servings": "8 Servings",
        "instructions": "NOTES : can also be made with 4 lb chuck roast, 1 pkg dressing mix and 1/2 cup water. MASTERCOOK RECIPES LIST SERVER"
    },
    {
        "image": [
            "https://www.joyousapron.com/wp-content/uploads/2021/03/Mee-Goreng-Sq-2.jpg"
        ],
        "price": "210",
        "category": "Asian",
        "title": "Mee Goreng (Fried Noodles Indian-Style)",
        "ingredients": [
            "5, oz Oil noodles or spaghetti",
            "2 ,tb Oil",
            "4 oz Peeled prawns or skinless boned chicken; diced meat",
            "1, sm Onion; chopped",
            "4, oz Cabbage; sliced",
            "1 ,sm Tomato; sliced",
            "1. 4, inch piece celery; chopped",
            "2, Cloves garlic; crushed",
            "1, Chilli; crushed",
            "1/2 ,Boiled potato; diced",
            "1, Egg; beaten",
            "1, tb Tomato ketchup",
            "2, tb Soy sauce",
            "1/4 ,ts Salt",
            "1/2 ,ts Sugar",
            "4 ,oz Beansprouts",
            "1 ,Lemon; juice of",
            "2, Sprigs coriander; chopped, up to 3"
        ],
        "servings": 1,
        "instructions": "If using spaghetti, cook it in boiling water until just tender, then drain and toss in a tablespoon of olive oil to stop it sticking together. No need to prepare the oil noodles. Heat the oil in a wok or frying pan and fry the garlic, onion, cabbage, celery, potato and prawns or chicken. Add the noodles and stir fry for 10 minutes more. Make a gap in the centre of the noodles and add the egg. Stir it in to scramble it. Add the chilli, tomato, tomato ketchup, soy sauce, salt and sugar. Stir well. Just before transferring to a plate, add the beansprouts and stir for about 30 seconds. Sprinkle with lemon juice and chopped coriander to serve."
    },
    {
        "image": [
            "https://cdn.tarladalal.com/members/9306/big/big_chapati_rolls_stuffed_with_spicy_potatoes-16861.jpg"
        ],
        "price": "250",
        "title": "Chapati with Spicy Potato Filling (Indian)",
        "category": "Asian",
        "ingredients": [
            "1 ,tb Oil",
            "2 ,Onions",
            "1 ,Dessertspoon ground chillies",
            "2, Potatoes, mashed",
            "1, md Carrot, grated",
            "1 ,ts Salt",
            "1, Stalk spring onion, chopped",
            "1 ,Sprig coriander leaves",
            "500 g ,Wholemeal flour (atta)",
            "1 1/2 ,c Water",
            "1/2, ts Salt",
            "3, tb Ghee"
        ],
        "servings": "16 Chapatis",
        "instructions": "Heat oil and lightly brown onions. Add chillies, mashed potatoes, grated carrot, salt and chopped spring onion and coriander leaves. Mix well. Remove from heat and allow to cool. Put wholemeal flour into a mixing bowl with salt. Mix into a firm ball of dough by adding water a little at a time. Spread 1 tablespoon of ghee on the dough and continue kneading. Repeat with another tablespoon of ghee. Lastly spread the last tablespoon of ghee onto the lump of dough and allow to stand for 30 minutes. Divide into small balls of dough. Flatten dough with the palm of your hands. Dip both sides into a little flour. Place chapati on a wooden board and roll out with a rolling pin. Brush with a little ghee and spread 1 tablespoon of spicy potato filling evenly on surface. Fold into half and then fold again to seal filling. Dip again into flour and roll out again into a thin square of chapati. Place chapati onto a flat pan over medium heat and brown both sides. Brush chapati with ghee on both sides while frying. Serve with your favourite curry, dhal or plain yoghurt."
    },
    {
        "image": [
            "https://www.beyondthechickencoop.com/wp-content/uploads/2021/06/Grilled-Flatbread.jpg"
        ],
        "price": "220",
        "title": "Chipati (Indian Griddle Fried Flat Bread)",
        "category": "Asian",
        "ingredients": [
            "3, c Whole wheat flour",
            "1 ,ts Salt",
            "1, c Water",
            "1 ,tb Ghee",
            "Yield - 20-24 Chipati"
        ],
        "servings": "4 Servings",
        "instructions": "Sift flour and salt together in a bowl. Make a well in the center and add ghee and water. Knead 10 minutes to make a pliable dough, form into a ball, cover and allow to rest at least 1 hour, or over night. Divide dough into 20-24 portions. Roll into 6 inch circles and allow to rest 5 minutes. Heat griddle or cast iron fry pan very hot. Place a chipati on the griddle or fry pan, fry for 1 minute. Flip over and fry for 1 minute."
    },
    {
        "image": [
            "https://everydangdish.com/wp-content/uploads/2020/05/Gujarati-Indian-Potatoes12.jpg"
        ],
        "price": "120",
        "title": "Gujarati Potatoes Indian",
        "category": "Asian",
        "ingredients": [
            "1 lb Potatoes, waxy type",
            "5 tb Olive oil",
            "3 lg Garlic cloves",
            "1/2 ts Ground turmeric",
            "1/8 ts Ground asafoetida",
            "1 ts Salt",
            "1 pn [generous]cayenne pepper or hot powder",
            "1 tb Sesame seed"
        ],
        "servings": "4 Servings",
        "instructions": "Sesame seed - I used pre-roasted from a Chinese grocery Gujarat is a part of India on the western coast, right at the Tropic of Cancer, between 20 and 25 deg. N. latitude. This recipe, adapted from Madhur Jaffrey, uses only one \"mystery ingredient,\" asafoetida powder (you should find some if you're going to get into Indian cooking at all.) Jaffrey says use two pounds of medium, very waxy boiling potatoes. I used one pound but left everything else the same and it was perfect for two hungry people. Peel potatoes (optional) and cut into long French-fries 3/8\" (9mm) square. Dunk in a bowl of cold water for 1/2 hour. Peel and sliver garlic. Heat the oil in a 9- or 10-inch skillet over medium. Drain and pat dry the potato fingers. Put potatoes in hot oil and turn occasionally for 8 or 10 minutes to partially cook -- not brown. Remove potatoes with tongs or slotted spoon to a plate with a paper towel on it. From here on you have to move kind of fast: throw the sesame seeds into the skillet, stir once. Add the garlic, and continue to stir. When it =just= begins to turn brown, quickly add turmeric and asafoetida, and stir once more. After just a couple of seconds put the potatoes back in, with salt and cayenne or hot powder. Reduce heat and cook gently until done. Stir frequently. (I added a tiny bit of water and loosely covered the skillet with a plate during the last few minutes.)"
    },
    {
        "image": [
            "https://media.istockphoto.com/id/878180648/photo/desi-pure-ghee-or-clarified-butter-in-glass-or-copper-container-with-spoon-selective-focus.jpg?s=612x612&w=0&k=20&c=gkjFRt3nwUbnK-bB3108rtN6pLrHA_nGDlRCm_ZI2l0="
        ],
        "price": "170",
        "title": "Ghee (Indian Butter Oil)",
        "category": "Asian",
        "ingredients": [
            "2 lb Butter, unsalted"
        ],
        "servings": "3 Cups",
        "instructions": "Divide butter into 1/4 pound pieces. In heavy 5 qt. saucepan, heat butter over moderate heat, stirring to melt slowly and completely without letting it brown. When completely melted, increase heat and bring the butter to a boil. When the surface is completely covered with white foam, stir the butter gently and reduce heat to the lowest possible point. Simmer uncovered and undisturbed for 45 minutes, or until the milk solids on the bottom of the pan are golden brown and the butter on top is transparent. Slowly pour the ghee through a linen towel or 4 layers of moistened cheesecloth. If the are any solids, no matter how small, strain again to prevent oil from becoming rancid later. The ghee must be perfectly clear. Pour the ghee into a jar or crock, cover tightly and store in refrigerator or at room temperature until ready to use. Ghee will solidify when it is chilled. If may be safely kept at room temperature for 2 or 3 months. NOTES: Although ghee resembles clarified butter, the long low heat cooking imparts a distinctive nutlike flavor that cannot be duplicated."
    },
    {
        "image": [
            "https://jehancancook.com/wp-content/uploads/2011/12/IMG_0585-1440x1067.jpg"
        ],
        "price": "180",
        "title": "Christmas Cake West Indian Style",
        "category": "Asian",
        "ingredients": [
            "--Fruit Mixture---",
            "1 c Raisins",
            "1 c Currants",
            "1/2 c Candied cherries",
            "1/2 c Candied citrus peel",
            "1 c Mixed dried fruit",
            "1 c Rum",
            "1 c Sweet sherry or port wine --Cake---",
            "1/2 lb Butter; at room temperature",
            "1/2 c Brown sugar",
            "4 Eggs",
            "2 c Flour",
            "1 ts Baking powder",
            "1 ts Ground ginger",
            "1 ts Ground nutmeg",
            "3 ts Ground cinnamon",
            "1/2 ts Ground cloves",
            "1/2 ts Ground allspice",
            "2 1/2 ts Lemon essence",
            "2 1/2 ts Almond essence",
            "1 ts Vanilla essence",
            "1/4 c Brown food coloring; up to 1/2 cup",
            "1/2 c Rum",
            "Additional rum for basting during storage"
        ],
        "servings": "1 Servings",
        "instructions": "Fruit Mixture: Mix together all the ingredients and store in a tightly sealed jar for at least 1 month The Cake: Prepare a 10\" deep round cake baking tin or a 13\" x 9\" baking tin by lining it with two layers of waxed paper, greasing between the layers. Preheat the oven to 250 degrees. In a large bowl, cream together the butter and sugar until they are light and fluffy. Add the eggs, one at a time, mixing well after each addition. Sift the flour, baking powder and all the dry spices together. Add the lemon essence, almond essence and vanilla essence to the fruit mixture. By hand, stir tablespoonsful of the flour mixture and the fruit mixture alternately into the butter, sugar and egg mixture. Add the browning gradually, stirring until a deepish brown colour is reached. Turn the cake mixture into the baking tin, smooth the top and bake in the oven for 3-4 hours or until a skewer or wooden toothpick, inserted, comes out clean. This can take an additional hour or two. Remove the cake from the oven, prick it all over with a skewer or toothpick and pour the rum all over it. Remove the cake from the tin when it is cool, wrap it tightly in waxed paper, place it in an airtight container and leave for a month for best flavour. Every week, prick the cake with a skewer and pour on about 1 tablespoon of rum. (Makes one 5 pound cake. ) Serve with Hard Rum Sauce. Full recipe name is Laurel-Ann's Wedding Cake or Christmas Cake West Indian Style"
    },
    {
        "image": [
            "https://1.bp.blogspot.com/-HjpyGGuSZ9E/XuPDiipt4II/AAAAAAAAQ68/QR2c_6aN-wgTTGZv8mTUjFiLIHL-d45lACNcBGAsYHQ/w1200-h630-p-k-no-nu/Sothi%2BKuzhambu.JPG"
        ],
        "price": "200",
        "title": "Sothi (South Indian)",
        "category": "Asian",
        "ingredients": [
            "1 c Thick coconut milk",
            "2 1/2 c Thin coconut milk",
            "1 Onion, ground",
            "3 Cloves garlic, ground",
            "2 1/2 Cm ginger, ground",
            "1 Onion, cut into wedges",
            "2 Sprigs curry leaves",
            "1 ts Turmeric powder",
            "1/4 ts Fenugreek",
            "2 ts Salt",
            "2 Potatoes, cut into wedges",
            "150 g Okra, kept whole",
            "150 g French beans, cut into two",
            "4 Cabbage leaves, cut into",
            "Squares",
            "3 Red chillies, coarsely",
            "Sliced",
            "3 Green chillies, coarsely",
            "Sliced",
            "2 Tomatoes, quartered",
            "1 tb Lime juice"
        ],
        "servings": "4 Servings",
        "instructions": "Put thin coconut milk in a cooking pot. Add \"A\" and bring to a slow boil. When vegetables are half-cooked, add tomatoes. Simmer till vegetables are soft, stirring occasionally. Add thick coconut milk, gently stirring to prevent curdling. When curry boils again, add lime juice and remove from heat. Serve with rice."
    },
    {
        "image": [
            "https://static.emerils.com/Calzone%20for%20web.jpg"
        ],
        "price": "240",
        "title": "Fresh Mozzarella, Italian Sausage and Roasted Pepper Calzon",
        "category": "Italian",
        "ingredients": [
            "1 Ball of basic pizza dough (enough dough for 1 pizza)",
            "1 tb Olive oil",
            "Salt and white pepper",
            "1/2 c Thick pesto",
            "1/2 c Roasted garlic",
            "1 c Diced Italian sausage, cooked",
            "1 Red pepper, roasted, peeled, seeded and julienned",
            "2 tb Chiffonade of basil",
            "4 sl (1/2-inch) fresh Mozzarella cheese",
            "1 Egg, beaten",
            "1 c Spicy tomato sauce, hot",
            "2 tb Grated Parmigiano-Reggiano cheese",
            "1 tb Chopped chives",
            "1 tb Brunoise red peppers"
        ],
        "servings": "2 Servings",
        "instructions": "Preheat the oven to 500 degrees. Place the dough out onto a floured surface. Roll the dough out to form a 12-inch circle. Spread the pesto over one half of the dough. Layer the garlic, sausage, peppe rs, and basil, alternately over the pesto. Lay the Mozzarella cheese over the basil. Fold the other side of the dough over the filling and pinch the edges to seal the calzone. Make three slashes acro ss the top of the calzone. Place the calzone on a parchment-lined baking sheet. Brush the calzone with the egg wash. Bake for 20 to 25 minutes or until golden. Spoon the sauce in the center of the pl ate. Slice the calzone in half and place in the center of the sauce. Garnish with the grated cheese, chives and brunoise peppers."
    },
    {
        "image": [
            "https://kfoods.com/images1/newrecipeicon/italian-style-chicken-breasts_2964.jpg"
        ],
        "price": "260",
        "title": "Microwave Chicken Breasts Italian",
        "category": "Italian",
        "ingredients": [
            "2 tb Olive oil",
            "1 md Onion",
            "1/2 Green pepper; chopped",
            "1/2 ts Oregano",
            "Salt and pepper; to taste",
            "Cayenne pepper; to taste",
            "1/2 Tes capers; drained",
            "1 pn Sugar",
            "1 1/2 ts Balsamic vinegar",
            "4 Chicken breasts without skin"
        ],
        "servings": "4 servings",
        "instructions": "1. Heat 1 1/2 tablespoons oil in a skillet with onion and pepper. Cook until softened, about 5 minutes. Add oregano, salt, black and cayenne peppers, capers and sugar. Cook as additional 2 minutes. 2. Transfer contents of skillet to a food processor and puree. Add remaining oil and balsamic. Taste and correct seasoning. (Recipe can be done ahead to this point) 3. Place chicken breasts in a microwave-oven proof dish or pie plate large enough to hold them in a single layer. Pour sauce over the chicken, cover the casserole loosely with waxed paper and cook on high power for 4 minutes. Turn the chicken, recover and cook an additional 4 minutes or until the chicken is cooked through but still juicy. Partially rotate the dish after 2, 4 and 6 minutes. Set aside for 2 minutes. 4. Spoon 1 or 2 chicken breasts and sauce onto heated plates. Serve with rice or steamed potatoes. NOTES : My MC II shows 28.4 CFF"
    },
    {
        "image": [
            "https://static.onecms.io/wp-content/uploads/sites/19/2004/07/07/chicken-herb-rs-663029-x.jpg"
        ],
        "price": "290",
        "title": "Chicken with Italian Herbs and Vegetables",
        "category": "Italian",
        "ingredients": [
            "6 Chicken breasts; boneless and skinless",
            "1/2 c White mushrooms; sliced 1/8\" thick",
            "1/2 c Red bell pepper sliced 1/8 \"",
            "1/2 c Green bell pepper sliced 1/8\"",
            "1/2 c Onion; sliced 1/8\"",
            "1 Clove fresh garlic; finely chopped",
            "1 ts Oregano; dried",
            "1 ts Basil; dried",
            "1 ts Salt",
            "1/2 ts Black pepper",
            "Canola oil as needed"
        ],
        "servings": "1 Servings",
        "instructions": "Flatten the chicken breasts between 2 sheets of plastic wrap with a mallet or heavy, flat-bottomed saucepan or skillet. Breasts should be a uniform thickness of about 1/2\". Rub the oregano, basil, salt and black pepper into the meat and then brush lightly with canola oil. Brush both sides of the Grilling Machine with oil and allow to pre-heat about 5 minutes. Mix all the vegetables together. Place veggies on the Grilling Machine, spread them out, and cover with the chicken. Grill for 7-8 minutes. Serves 6."
    },
    {
        "image": [
            "https://upload.wikimedia.org/wikipedia/commons/2/2c/Buona_Chicago%27s_Original_Italian_Beef.jpg"
        ],
        "price": "150",
        "title": "Chicago Italian Beef Sandwiches",
        "category": "Italian",
        "ingredients": [
            "2 lb Beef roast, leftover,",
            "Pre-roasted",
            "Roasting pan drippings",
            "2 tb Fresh oregano, finely",
            "Chopped",
            "OR 2 teaspoon dried",
            "Oregano, crushed",
            "1 tb Fresh sweet basil,",
            "Finely chopped",
            "OR 1 teaspoon dried",
            "Basil, crushed",
            "1 ts Whole black peppercorns",
            "1/2 ts Red pepper, ground (1/2",
            "To 1)",
            "1 tb Fresh parsley, minced",
            "Salt, to taste",
            "3 cl Garlic, minced",
            "1 Fresh green pepper seeded",
            "And",
            "sl Into 1/4 inch strips"
        ],
        "servings": "8 Servings",
        "instructions": "Thinly slice cooked, roast beef and place in a Dutch oven (or put it back into the same pan in which the beef was roasted). Add enough water to cover. Add remaining ingredients and bring to simmer. After the beef has cooked for awhile, taste and adjust seasonings. Cook about 1 hour. Serve beef only on Italian bread with grilled green peppers and / or giardinera relish. As you serve dip the sandwich in your gravy."
    },
    {
        "image": [
            "https://oursaltykitchen.com/wp-content/uploads/2020/04/italian-potato-salad-featured-image.jpg"
        ],
        "price": "290",
        "title": "Vlf Italian Potato Salad",
        "category": "Italian",
        "ingredients": [
            "1 lb New red potatoes",
            "1/4 c Water",
            "1 sm Red onion, thinly sliced",
            "x Several sliced ripe black",
            "Olives (optional)",
            "1 sm Cucumber, chopped",
            "1 Tomato, chopped",
            "1/2 c Fat free Italian dressing",
            "2 tb Snipped fresh parsley"
        ],
        "servings": "1 Servings",
        "instructions": "1. Scrub potatoes; cut crosswise into 1/4 in. slices. Place in 1 1/2 qt. microwave safe casserole. Add water. Cover with lid. Microwave on high for 9-10 min. or until potatoes are tender; stirring once. Drain and cool. 2. Add onions, olives, cucumber, tomato, dressing and parsley. Mix lightly to coat evenly. Refrigerate until chilled. Stir before serving."
    },
    {
        "image": [
            "https://posustainableseafood.com/wp-content/uploads/2021/05/ourcatch_montalcino_1500sq-e1629926270701.jpg"
        ],
        "price": "300",
        "title": "Halibut Italiano",
        "category": "Italian",
        "ingredients": [
            "1 1/2 lb Halibut fillets cut into 4 servings",
            "2 c Prepared spaghetti sauce",
            "1/2 c Sliced mushrooms",
            "1/4 c Sliced olives",
            "1/2 c Mozzarella or cheddar cheese",
            "Olive oil"
        ],
        "servings": "1 Servings",
        "instructions": "Place fish in oiled baking pan. Top with mushrooms and olives. Pour spaghetti sauce over the top and bake for 10 minutes at 400o. Remove from oven and sprinkle with cheese. Bake 10 more minutes or until fish flakes easily with a fork. Serve with chopped parsley over the top and a lemon wedge on the side."
    },
    {
        "image": [
            "https://seitanbeatsyourmeat.com/wp-content/uploads/2020/05/chicago-style-giardiniera-recipe.jpg"
        ],
        "price": "200",
        "title": "Giardiniera #5 - Italian",
        "category": "Italian",
        "ingredients": [
            "Fresh chiles of choice",
            "1/2 Part water",
            "1/2 Part vinegar",
            "1 ts Non-idodized salt per pint of liquid",
            "Cauliflower; in flowerets",
            "Broccoli; in flowerets",
            "Carrots; cut in coins",
            "Use baby carrots",
            "Pearl onions",
            "Garlic cloves; whole",
            "Green olives"
        ],
        "servings": "1 Servings",
        "instructions": "\"This basic recipe can be used for pickling chiles either alone or with a combination of other vegetables. Choose the mixture of vegetables desired, the amount and type of chiles, and arrange them attractively in a jar before covering with the pickling solution.\" Wash the chiles and with a toothpick poke several holes near the stem before packing in the jars. Combine the water, vinegar, and salt in a pan and boil for a minute. Pour the hot mixture over the vegetables leaving 1/4 inch head space and cover. Allow the chiles and vegetables to pickle for 2 to 3 weeks before serving."
    },
    {
        "image": [
            "https://thewanderlustkitchen.com/wp-content/uploads/2013/11/Quick-Crockpot-Fondue-square-1200.jpg"
        ],
        "price": "220",
        "title": "Crockpot Fondue Italiano",
        "category": "Italian",
        "ingredients": [
            "1 lb Lean ground beef",
            "8 oz Mozzarella cheese",
            "1 Envelope spaghetti sauce mix",
            "2 15 oz cans tomato sauce",
            "2 tb Cornstarch",
            "1 lb Sharp cheddar cheese",
            "1/2 c Dry red wine"
        ],
        "servings": "1 Servings",
        "instructions": "In a skillet or crock-pot with a browning unit, cook beef until crumbly; pour off excess fat. In the crock- pot, combine beef with dry spaghetti sauce mix, tomato sauce, cheddar and mozzarella cheeses. Cover and cook on low for 2 hours. Dissolve cornstarch in the wine. Turn control to high. Add dissolved cornstarch. Heat on high for 10 to 15 minutes. Dip chunks of Italian bread into the fondue while > keeping the mixture hot in the crock-pot. Makes 6 to 8 serv."
    },
    {
        "image": [
            "https://www.fromvalerieskitchen.com/wordpress/wp-content/uploads/2021/10/Crock-Pot-Italian-Beef-Sandwiches-07.jpg"
        ],
        "price": "250",
        "title": "Crockpot Italian Beef #1",
        "category": "Italian",
        "ingredients": [
            "1 Rump roast; 3-5 lbs",
            "1 pk Good Seasons Italian dressing mix",
            "1 c Water",
            "1 pk Au jus gravy packet",
            "2 ts Italian seasoning",
            "6 Pepperocini peppers"
        ],
        "servings": "8 Servings",
        "instructions": "NOTES : can also be made with 4 lb chuck roast, 1 pkg dressing mix and 1/2 cup water. MASTERCOOK RECIPES LIST SERVER"
    }
]