


  { "image":[],
    "category":"",
    "title": "Mee Goreng (Fried Noodles Indian-Style)",
    "ingredients": "5, oz Oil noodles or spaghetti|2 ,tb Oil|4 oz Peeled prawns or skinless boned chicken; diced meat|1, sm Onion; chopped|4, oz Cabbage; sliced|1 ,sm Tomato; sliced|1. 4, inch piece celery; chopped|2, Cloves garlic; crushed|1, Chilli; crushed|1/2 ,Boiled potato; diced|1, Egg; beaten|1, tb Tomato ketchup|2, tb Soy sauce|1/4 ,ts Salt|1/2 ,ts Sugar|4 ,oz Beansprouts|1 ,Lemon; juice of|2, Sprigs coriander; chopped, up to 3",
    "servings": 1,
    "instructions": "If using spaghetti, cook it in boiling water until just tender, then drain and toss in a tablespoon of olive oil to stop it sticking together. No need to prepare the oil noodles. Heat the oil in a wok or frying pan and fry the garlic, onion, cabbage, celery, potato and prawns or chicken. Add the noodles and stir fry for 10 minutes more. Make a gap in the centre of the noodles and add the egg. Stir it in to scramble it. Add the chilli, tomato, tomato ketchup, soy sauce, salt and sugar. Stir well. Just before transferring to a plate, add the beansprouts and stir for about 30 seconds. Sprinkle with lemon juice and chopped coriander to serve."
  },
  {
    "title": "Chapati with Spicy Potato Filling (Indian)",
    "ingredients": "1 ,tb Oil|2 ,Onions|1 ,Dessertspoon ground chillies|2, Potatoes, mashed|1, md Carrot, grated|1 ,ts Salt|1, Stalk spring onion, chopped|1 ,Sprig coriander leaves|500 g ,Wholemeal flour (atta)|1 1/2 ,c Water|1/2, ts Salt|3, tb Ghee",
    "servings": "16 Chapatis",
    "instructions": "Heat oil and lightly brown onions. Add chillies, mashed potatoes, grated carrot, salt and chopped spring onion and coriander leaves. Mix well. Remove from heat and allow to cool. Put wholemeal flour into a mixing bowl with salt. Mix into a firm ball of dough by adding water a little at a time. Spread 1 tablespoon of ghee on the dough and continue kneading. Repeat with another tablespoon of ghee. Lastly spread the last tablespoon of ghee onto the lump of dough and allow to stand for 30 minutes. Divide into small balls of dough. Flatten dough with the palm of your hands. Dip both sides into a little flour. Place chapati on a wooden board and roll out with a rolling pin. Brush with a little ghee and spread 1 tablespoon of spicy potato filling evenly on surface. Fold into half and then fold again to seal filling. Dip again into flour and roll out again into a thin square of chapati. Place chapati onto a flat pan over medium heat and brown both sides. Brush chapati with ghee on both sides while frying. Serve with your favourite curry, dhal or plain yoghurt."
  },
  {
    "title": "Chipati (Indian Griddle Fried Flat Bread)",
    "ingredients": "3, c Whole wheat flour|1 ,ts Salt|1, c Water|1 ,tb Ghee|Yield - 20-24 Chipati",
    "servings": "4 Servings",
    "instructions": "Sift flour and salt together in a bowl. Make a well in the center and add ghee and water. Knead 10 minutes to make a pliable dough, form into a ball, cover and allow to rest at least 1 hour, or over night. Divide dough into 20-24 portions. Roll into 6 inch circles and allow to rest 5 minutes. Heat griddle or cast iron fry pan very hot. Place a chipati on the griddle or fry pan, fry for 1 minute. Flip over and fry for 1 minute."
  },
  {
    "title": "Wakavaki Indian Soup",
    "ingredients": "6 3/4 lb Short ribs|6 Ears corn; (cut into thirds)|4 1/2 lb Cabbage|1 1/2 lb Zucchini|2 lb Carrot|2 cn Green beans|2 cn Garbanzo beans; (15 oz. can)|2 tb Salt|3 Cloves garlic",
    "servings": "4 Servings",
    "instructions": "Cook short ribs in 20 cups of water for 1 hour over medium flame. Add carrots, corn and garlic and then cook for 1/2 hour. Next add cabbage and 10 cups of HOT water and continue cooking for 15 minutes. Next add garbanzo beans, green beans, zucchini, 2 tablespoons of salt and then cook 1 additional hour. Serve each bowl with 2 cups of soup and include 1 piece of corn and 2 short ribs in the bowl. Serve the soup with a tortilla. Tucson, Arizona"
  },
  
  {
    "title": "Gujarati Potatoes Indian",
    "ingredients": "1 lb Potatoes, waxy type|5 tb Olive oil|3 lg Garlic cloves|1/2 ts Ground turmeric|1/8 ts Ground asafoetida|1 ts Salt|1 pn [generous]cayenne pepper or hot powder|1 tb Sesame seed",
    "servings": "4 Servings",
    "instructions": "Sesame seed - I used pre-roasted from a Chinese grocery Gujarat is a part of India on the western coast, right at the Tropic of Cancer, between 20 and 25 deg. N. latitude. This recipe, adapted from Madhur Jaffrey, uses only one \"mystery ingredient,\" asafoetida powder (you should find some if you're going to get into Indian cooking at all.) Jaffrey says use two pounds of medium, very waxy boiling potatoes. I used one pound but left everything else the same and it was perfect for two hungry people. Peel potatoes (optional) and cut into long French-fries 3/8\" (9mm) square. Dunk in a bowl of cold water for 1/2 hour. Peel and sliver garlic. Heat the oil in a 9- or 10-inch skillet over medium. Drain and pat dry the potato fingers. Put potatoes in hot oil and turn occasionally for 8 or 10 minutes to partially cook -- not brown. Remove potatoes with tongs or slotted spoon to a plate with a paper towel on it. From here on you have to move kind of fast: throw the sesame seeds into the skillet, stir once. Add the garlic, and continue to stir. When it =just= begins to turn brown, quickly add turmeric and asafoetida, and stir once more. After just a couple of seconds put the potatoes back in, with salt and cayenne or hot powder. Reduce heat and cook gently until done. Stir frequently. (I added a tiny bit of water and loosely covered the skillet with a plate during the last few minutes.)"
  },
  {
    "title": "Ghee (Indian Butter Oil)",
    "ingredients": "2 lb Butter, unsalted",
    "servings": "3 Cups",
    "instructions": "Divide butter into 1/4 pound pieces. In heavy 5 qt. saucepan, heat butter over moderate heat, stirring to melt slowly and completely without letting it brown. When completely melted, increase heat and bring the butter to a boil. When the surface is completely covered with white foam, stir the butter gently and reduce heat to the lowest possible point. Simmer uncovered and undisturbed for 45 minutes, or until the milk solids on the bottom of the pan are golden brown and the butter on top is transparent. Slowly pour the ghee through a linen towel or 4 layers of moistened cheesecloth. If the are any solids, no matter how small, strain again to prevent oil from becoming rancid later. The ghee must be perfectly clear. Pour the ghee into a jar or crock, cover tightly and store in refrigerator or at room temperature until ready to use. Ghee will solidify when it is chilled. If may be safely kept at room temperature for 2 or 3 months. NOTES: Although ghee resembles clarified butter, the long low heat cooking imparts a distinctive nutlike flavor that cannot be duplicated."
  },
  {
    "title": "Christmas Cake West Indian Style",
    "ingredients": "--Fruit Mixture---|1 c Raisins|1 c Currants|1/2 c Candied cherries|1/2 c Candied citrus peel|1 c Mixed dried fruit|1 c Rum|1 c Sweet sherry or port wine --Cake---|1/2 lb Butter; at room temperature|1/2 c Brown sugar|4 Eggs|2 c Flour|1 ts Baking powder|1 ts Ground ginger|1 ts Ground nutmeg|3 ts Ground cinnamon|1/2 ts Ground cloves|1/2 ts Ground allspice|2 1/2 ts Lemon essence|2 1/2 ts Almond essence|1 ts Vanilla essence|1/4 c Brown food coloring; up to 1/2 cup|1/2 c Rum|Additional rum for basting during storage",
    "servings": "1 Servings",
    "instructions": "Fruit Mixture: Mix together all the ingredients and store in a tightly sealed jar for at least 1 month The Cake: Prepare a 10\" deep round cake baking tin or a 13\" x 9\" baking tin by lining it with two layers of waxed paper, greasing between the layers. Preheat the oven to 250 degrees. In a large bowl, cream together the butter and sugar until they are light and fluffy. Add the eggs, one at a time, mixing well after each addition. Sift the flour, baking powder and all the dry spices together. Add the lemon essence, almond essence and vanilla essence to the fruit mixture. By hand, stir tablespoonsful of the flour mixture and the fruit mixture alternately into the butter, sugar and egg mixture. Add the browning gradually, stirring until a deepish brown colour is reached. Turn the cake mixture into the baking tin, smooth the top and bake in the oven for 3-4 hours or until a skewer or wooden toothpick, inserted, comes out clean. This can take an additional hour or two. Remove the cake from the oven, prick it all over with a skewer or toothpick and pour the rum all over it. Remove the cake from the tin when it is cool, wrap it tightly in waxed paper, place it in an airtight container and leave for a month for best flavour. Every week, prick the cake with a skewer and pour on about 1 tablespoon of rum. (Makes one 5 pound cake. ) Serve with Hard Rum Sauce. Full recipe name is Laurel-Ann's Wedding Cake or Christmas Cake West Indian Style"
  },
  {
    "title": "Sothi (South Indian)",
    "ingredients": "1 c Thick coconut milk|2 1/2 c Thin coconut milk|1 Onion, ground|3 Cloves garlic, ground|2 1/2 Cm ginger, ground|1 Onion, cut into wedges|2 Sprigs curry leaves|1 ts Turmeric powder|1/4 ts Fenugreek|2 ts Salt|2 Potatoes, cut into wedges|150 g Okra, kept whole|150 g French beans, cut into two|4 Cabbage leaves, cut into|Squares|3 Red chillies, coarsely|Sliced|3 Green chillies, coarsely|Sliced|2 Tomatoes, quartered|1 tb Lime juice",
    "servings": "4 Servings",
    "instructions": "Put thin coconut milk in a cooking pot. Add \"A\" and bring to a slow boil. When vegetables are half-cooked, add tomatoes. Simmer till vegetables are soft, stirring occasionally. Add thick coconut milk, gently stirring to prevent curdling. When curry boils again, add lime juice and remove from heat. Serve with rice."
  }


====================================================================Italian :
{
    "title": "Fresh Mozzarella, Italian Sausage and Roasted Pepper Calzon",
    "ingredients": "1 Ball of basic pizza dough (enough dough for 1 pizza)|1 tb Olive oil|Salt and white pepper|1/2 c Thick pesto|1/2 c Roasted garlic|1 c Diced Italian sausage, cooked|1 Red pepper, roasted, peeled, seeded and julienned|2 tb Chiffonade of basil|4 sl (1/2-inch) fresh Mozzarella cheese|1 Egg, beaten|1 c Spicy tomato sauce, hot|2 tb Grated Parmigiano-Reggiano cheese|1 tb Chopped chives|1 tb Brunoise red peppers",
    "servings": "2 Servings",
    "instructions": "Preheat the oven to 500 degrees. Place the dough out onto a floured surface. Roll the dough out to form a 12-inch circle. Spread the pesto over one half of the dough. Layer the garlic, sausage, peppe rs, and basil, alternately over the pesto. Lay the Mozzarella cheese over the basil. Fold the other side of the dough over the filling and pinch the edges to seal the calzone. Make three slashes acro ss the top of the calzone. Place the calzone on a parchment-lined baking sheet. Brush the calzone with the egg wash. Bake for 20 to 25 minutes or until golden. Spoon the sauce in the center of the pl ate. Slice the calzone in half and place in the center of the sauce. Garnish with the grated cheese, chives and brunoise peppers."
  },
  {
    "title": "Grandma Demaio's Italian Stew",
    "ingredients": "1 lb Italian sausage; or hot dogs|4 lg Tomatoes; peeled and sliced*|1 lg Green pepper; sliced|2 Zucchini; sliced|2 lg Potatoes; sliced|1 lg Maui onion; sliced|3 Cloves garlic; pressed|2 ts Sweet basil|1 ts Oregano|1 ts Parsley|1 ts Salt|1/2 ts Pepper",
    "servings": "6 servings",
    "instructions": "* or 2-14oz cans This is a very easy recipe. Simply brown the sausage, add all the veggies and cook for about an hour over a low flame. The stew should simmer, but never reach a hard boil. When Grandma didn't have sausage, she often used hot dogs, which we just loved! My husband's grandmother used to make this stew during the harvest season. She and Grandpa lived on a small farm and all the veggies and herbs were grown on the farm. Grandma also made her own Italian sausage. Although I find this rendition a fair imitation, nothing can compare with Grandma's Stew (can't even remember the correct name for it). Grandma DeMaio's stew was lovingly preparred on top of a wood burning stove! How we all loved it! Per serving: 329 Calories (kcal); 24g Total Fat; (65% calories from fat); 13g Protein; 16g Carbohydrate; 58mg Cholesterol; 921mg Sodium Food Exchanges: 1/2 Grain(Starch); 1 1/2 Lean Meat; 1 1/2 Vegetable; 0 Fruit; 4 Fat; 0 Other Carbohydrates"
  },
  {
    "title": "Microwave Chicken Breasts Italian",
    "ingredients": "2 tb Olive oil|1 md Onion|1/2 Green pepper; chopped|1/2 ts Oregano|Salt and pepper; to taste|Cayenne pepper; to taste|1/2 Tes capers; drained|1 pn Sugar|1 1/2 ts Balsamic vinegar|4 Chicken breasts without skin",
    "servings": "4 servings",
    "instructions": "1. Heat 1 1/2 tablespoons oil in a skillet with onion and pepper. Cook until softened, about 5 minutes. Add oregano, salt, black and cayenne peppers, capers and sugar. Cook as additional 2 minutes. 2. Transfer contents of skillet to a food processor and puree. Add remaining oil and balsamic. Taste and correct seasoning. (Recipe can be done ahead to this point) 3. Place chicken breasts in a microwave-oven proof dish or pie plate large enough to hold them in a single layer. Pour sauce over the chicken, cover the casserole loosely with waxed paper and cook on high power for 4 minutes. Turn the chicken, recover and cook an additional 4 minutes or until the chicken is cooked through but still juicy. Partially rotate the dish after 2, 4 and 6 minutes. Set aside for 2 minutes. 4. Spoon 1 or 2 chicken breasts and sauce onto heated plates. Serve with rice or steamed potatoes. NOTES : My MC II shows 28.4 CFF"
  },
  {
    "title": "Chicken with Italian Herbs and Vegetables",
    "ingredients": "6 Chicken breasts; boneless and skinless|1/2 c White mushrooms; sliced 1/8\" thick|1/2 c Red bell pepper sliced 1/8 \"|1/2 c Green bell pepper sliced 1/8\"|1/2 c Onion; sliced 1/8\"|1 Clove fresh garlic; finely chopped|1 ts Oregano; dried|1 ts Basil; dried|1 ts Salt|1/2 ts Black pepper|Canola oil as needed",
    "servings": "1 Servings",
    "instructions": "Flatten the chicken breasts between 2 sheets of plastic wrap with a mallet or heavy, flat-bottomed saucepan or skillet. Breasts should be a uniform thickness of about 1/2\". Rub the oregano, basil, salt and black pepper into the meat and then brush lightly with canola oil. Brush both sides of the Grilling Machine with oil and allow to pre-heat about 5 minutes. Mix all the vegetables together. Place veggies on the Grilling Machine, spread them out, and cover with the chicken. Grill for 7-8 minutes. Serves 6."
  },
  {
    "title": "Chicago Italian Beef Sandwiches",
    "ingredients": "2 lb Beef roast, leftover,|Pre-roasted|Roasting pan drippings|2 tb Fresh oregano, finely|Chopped|OR 2 teaspoon dried|Oregano, crushed|1 tb Fresh sweet basil,|Finely chopped|OR 1 teaspoon dried|Basil, crushed|1 ts Whole black peppercorns|1/2 ts Red pepper, ground (1/2|To 1)|1 tb Fresh parsley, minced|Salt, to taste|3 cl Garlic, minced|1 Fresh green pepper seeded|And|sl Into 1/4 inch strips",
    "servings": "8 Servings",
    "instructions": "Thinly slice cooked, roast beef and place in a Dutch oven (or put it back into the same pan in which the beef was roasted). Add enough water to cover. Add remaining ingredients and bring to simmer. After the beef has cooked for awhile, taste and adjust seasonings. Cook about 1 hour. Serve beef only on Italian bread with grilled green peppers and / or giardinera relish. As you serve dip the sandwich in your gravy."
  },
  {
    "title": "Vlf Italian Potato Salad",
    "ingredients": "1 lb New red potatoes|1/4 c Water|1 sm Red onion, thinly sliced|x Several sliced ripe black|Olives (optional)|1 sm Cucumber, chopped|1 Tomato, chopped|1/2 c Fat free Italian dressing|2 tb Snipped fresh parsley",
    "servings": "1 Servings",
    "instructions": "1. Scrub potatoes; cut crosswise into 1/4 in. slices. Place in 1 1/2 qt. microwave safe casserole. Add water. Cover with lid. Microwave on high for 9-10 min. or until potatoes are tender; stirring once. Drain and cool. 2. Add onions, olives, cucumber, tomato, dressing and parsley. Mix lightly to coat evenly. Refrigerate until chilled. Stir before serving."
  },
  {
    "title": "Halibut Italiano",
    "ingredients": "1 1/2 lb Halibut fillets cut into 4 servings|2 c Prepared spaghetti sauce|1/2 c Sliced mushrooms|1/4 c Sliced olives|1/2 c Mozzarella or cheddar cheese|Olive oil",
    "servings": "1 Servings",
    "instructions": "Place fish in oiled baking pan. Top with mushrooms and olives. Pour spaghetti sauce over the top and bake for 10 minutes at 400o. Remove from oven and sprinkle with cheese. Bake 10 more minutes or until fish flakes easily with a fork. Serve with chopped parsley over the top and a lemon wedge on the side."
  },
  {
    "title": "Giardiniera #5 - Italian",
    "ingredients": "Fresh chiles of choice|1/2 Part water|1/2 Part vinegar|1 ts Non-idodized salt per pint of liquid|Cauliflower; in flowerets|Broccoli; in flowerets|Carrots; cut in coins|Use baby carrots|Pearl onions|Garlic cloves; whole|Green olives",
    "servings": "1 Servings",
    "instructions": "\"This basic recipe can be used for pickling chiles either alone or with a combination of other vegetables. Choose the mixture of vegetables desired, the amount and type of chiles, and arrange them attractively in a jar before covering with the pickling solution.\" Wash the chiles and with a toothpick poke several holes near the stem before packing in the jars. Combine the water, vinegar, and salt in a pan and boil for a minute. Pour the hot mixture over the vegetables leaving 1/4 inch head space and cover. Allow the chiles and vegetables to pickle for 2 to 3 weeks before serving."
  },
  {
    "title": "Crockpot Fondue Italiano",
    "ingredients": "1 lb Lean ground beef|8 oz Mozzarella cheese|1 Envelope spaghetti sauce mix|2 15 oz cans tomato sauce|2 tb Cornstarch|1 lb Sharp cheddar cheese|1/2 c Dry red wine",
    "servings": "1 Servings",
    "instructions": "In a skillet or crock-pot with a browning unit, cook beef until crumbly; pour off excess fat. In the crock- pot, combine beef with dry spaghetti sauce mix, tomato sauce, cheddar and mozzarella cheeses. Cover and cook on low for 2 hours. Dissolve cornstarch in the wine. Turn control to high. Add dissolved cornstarch. Heat on high for 10 to 15 minutes. Dip chunks of Italian bread into the fondue while > keeping the mixture hot in the crock-pot. Makes 6 to 8 serv."
  },
  {
    "title": "Crockpot Italian Beef #1",
    "ingredients": "1 Rump roast; 3-5 lbs|1 pk Good Seasons Italian dressing mix|1 c Water|1 pk Au jus gravy packet|2 ts Italian seasoning|6 Pepperocini peppers",
    "servings": "8 Servings",
    "instructions": "NOTES : can also be made with 4 lb chuck roast, 1 pkg dressing mix and 1/2 cup water. MASTERCOOK RECIPES LIST SERVER"
  }

======================================================================Asian :
 {
    "title": "Golden Tofu Wrap with Warm Asian Slaw",
    "ingredients": "1 tb Peanut oil|1 lb Low-fat extra-firm tofu OR firm; drained and cut into 1-inch cubes, blotted dry|2 md Garlic cloves; minced|1 sm Jalapeno OR other fresh chile; stemmed seeded if desired, minced|1 1/2 lb Red cabbage; shredded as directed|2 tb Rice wine vinegar|2 tb Soy sauce|2 tb Minced fresh cilantro leaves|4 lg Whole-wheat tortillas; (12-inch)",
    "servings": "4 servings",
    "instructions": "INTRO: Golden brown pieces of sauteed tofu are a good foil for a cabbage slaw with Asian seasonings. Serve any extra slaw on the side. For less heat, remove the seeds from the Chile before mincing. 1. Prepare the cabbage. Remove tough outer leaves; quarter. Trim: remove tough white stem/parts. Slice crosswise into very thin strips. 2. Heat 1 tablespoon oil until almost smoking in large nonstick skillet set over medium-high heat. Add tofu and cook, turning pieces every minute or so, until golden brown, about 5 minutes. Transfer tofu to medium bowl. 3. Add garlic and jalapeno to empty skillet and stir-fry over high heat until fragrant, about 20 seconds. Add cabbage and stir-fry until slightly wilted, about 2 minutes. Add vinegar and soy sauce, cover, and cook until cabbage is crisp-tender, about 5 minutes. Stir in cilantro and remove pan from heat. Allow slaw to cool slightly. 4. Meanwhile, heat each tortilla until warm in clean skillet set over medium heat. Lay tortillas flat on work surface. Spread about 3/4 cup slaw down center of each and top with several pieces of tofu. Roll up, tucking sides toward center to form bundle. Slice each roll in half and serve immediately. PER SERVING: 200 calories, 25 percent from fat. 14g protein, 6g fat, 32g carbs, 6g fiber, 672 mg sodium. Good source vitamin C. mc by kitpath 4/27/99"
  },
  {
    "title": "Bean Thread Noodles with Beef And Asian Pear",
    "ingredients": "1/4 lb Bean-thread noodles; (also known as cellophane noodles)|4 Garlic cloves; minced|1/3 c Soy sauce|2 tb Sugar|1 tb Asian sesame oil|1 ts Dried hot red pepper flakes|1/2 c Plus 1 teaspoon rice vinegar; (not seasoned)|1 lb Filet mignon; cut into 1/4-inch-thick julienne strips|2 cn Beef broth; (14 1/2-oz)|1/4 c Water|1 Asian pear; cut into julienne strips|2 Scallions; (green parts only), thinly sliced",
    "servings": "1 servings",
    "instructions": "Soak noodles in a bowl of cold water until pliable, about 15 minutes, and drain. Cut into 2-inch lengths. While noodles are soaking, stir together garlic, soy sauce, sugar, sesame oil, red pepper flakes, and 1/2 cup vinegar. Add beef and marinate at room temperature, stirring occasionally, 15 minutes. Bring broth and water to a boil. Add beef and marinade and cook 2 minutes. Stir in noodles and cook until just tender, about 2 minutes. Toss pear and scallions with remaining teaspoon vinegar. Spoon noodles and broth into bowls and top with pear and scallions. Makes 4 servings."
  },
  {
    "title": "Beer Battered Soft-Shell Crabs with Asian Dipping Sauce",
    "ingredients": "=== BEER BATTER ===|1 c All purpose flour - (scant); plus extra|For dusting|12 oz Beer; reserving 4 oz|To thin batter if necessary|=== SAUCE ===|3 tb Fresh lime juice|3 tb Thai fish sauce; (nam plo)|(available at speciality or Asian markets)|1 tb Honey|3 tb Water|2 Garlic cloves; minced|1 Scallion; thinly sliced|2 sl Habenero; Scotch bonnet, or jalapeno|Chile; (very thin slices), see * Note|=== CRABS ===|4 md Soft-shell crabs; cleaned, rinsed|Milk; for soaking crabs|Salt; to taste|Freshly-ground black pepper; to taste|Peanut oil; for frying|=== GARNISH ===|Scallion brushes|Cilantro sprigs|Lime wedges",
    "servings": "4 servings",
    "instructions": "* Note: Select chile type depending on desired degree of heat wanted. Put the flour into a bowl and make a well in the center. Pour 1 cup of the beer into the well and whisk until the mixture is just combined. Strain the batter through a sieve into a clean bowl and let it rest, covered, for 1 hour. Before using batter, whisk in additional beer, if necessary, to achieve desired consistency. In a small bowl whisk together the lime juice, fish sauce and honey until dissolved. Add the water, garlic, scallion and chili slices. Set aside. Clean the soft-shell crabs by first cutting away the eyes and mouth. Lift up the top side flaps and pull out the feathery gills. Turn the crab over and fold back the tail flap, also called the apron, and pull away from the body and discard. Place crabs in a shallow dish and add enough milk to cover. Soak crabs for 10 to 15 minutes. In a heavy deep pan heat 2 inches of peanut oil to 350 degrees. Season the crabs with salt and pepper. Dust the crabs with flour, shaking off any excess. Coat and fry crabs two at a time. Dip each crab into the beer batter and allow extra batter to drip back into bowl. Carefully lower the crabs into the heated oil and fry until golden brown, turning once, about 2 minutes per side. Transfer fried crabs to paper towels to drain. Repeat process with remaining two crabs. Arrange crabs on individual serving plates. Garnish with scallion brushes, cilantro sprigs and lime wedges. Serve immediately with dipping sauce on the side. This recipe yields 4 servings."
  },
  {
    "title": "SE Asian Cabbage Salad with Cucumber Peanuts and Cilantro",
    "ingredients": "1 Head white cabbage, cored, thinly sliced|4 To 6 garlic cloves, chopped|1/2 English cucumber, cut into bite-sized pieces|1 Carrot, coarsely grated|1/2 c Distilled white vinegar|3 tb Sugar or honey|3 tb Soy sauce or fish sauce|2 Fresh chiles, seeded, chopped|1/4 c Mild vegetable oil|2/3 c Dry-roasted peanuts, coarsely chopped|2 To 3 tablespoons coarsely chopped cilantro",
    "servings": "4 Servings",
    "instructions": "Toss cabbage with garlic, cucumber, carrot, vinegar, sugar or honey, soy sauce or fish sauce, chiles and vegetable oil. Chill until ready to serve, then top with peanuts and cilantro. Serves 4 to 6. PER SERVING: 205 calories, 6 g protein, 11 g carbohydrate, 17 g fat (2 g saturated), 0 mg cholesterol, 535 mg sodium, 4 g fiber."
  },
  {
    "title": "Seared Ahi Served with Floral of Asian Greens (Hl)",
    "ingredients": "6 oz Ahi or yellow fin tuna|1 Nori sheet|Salt and pepper; to taste --floral greens---|1 Roma tomato|6 Enoki mushrooms|6 Warabi sprouts|3 Mizuna leaves or asian greens --dressing---|2 Shallots|2 ts Olive oil|3 ts Red wine vinegar|1 sm Bunch chopped fresh parsley",
    "servings": "1 Servings",
    "instructions": "Season ahi with salt and pepper. Wrap nori sheet around ahi. Saute in a teflon pan. Floral Greens: Blanch tomato and peel, then hollow out the inside. Arrange enoki mushrooms, warabi sprouts and Asian greens in tomato. Dressing: Mix red wine vinegar, olive oil, shallots and parsley in bowl. Pour over the Floral Greens. Yield: 1 serving Recipe courtesy of Chef Mark Tsuchiyama, Sheraton Maui"
  },
  {
    "title": "Seared Cervena Venison with Asian Pan Juice",
    "ingredients": "8 Cervena medallions, (8 to 3)|2 tb Mixed toasted black and white sesame seeds|2 tb Olive oil|1 ts Chopped scallions|1 ts Chopped garlic|1/4 c Chicken stock|1 tb Oyster sauce|1 ts Dark soy sauce|1 Piece star anise|1 tb Chopped cilantro|1 tb Butter|4 tb Leeks, julienned|2 c Peanut oil for frying",
    "servings": "1 Servings",
    "instructions": "Roll the Cervena medallions in the sesame seeds and set aside. In a large skillet over high heat, heat the olive oil and sear medallions on each side, set aside on oven tray. In the skillet saute the scallions and garlic for a few minutes. Add chicken stock, oyster sauce, soy sauce, star anise and cilantro. Simmer for about 6 minutes. Strain. Fry the leeks and finish cooking the medallions in a 400 degree oven for 5 minutes. Rest the meat for three minutes. In the meantime bring the sauce back to a boil and whisk in butter. Transfer to serving plate and spoon sauce over meat. Top with fried leeks. Yield: 4 servings"
  },
  {
    "title": "Marinated Asian Vegetable Salad",
    "ingredients": "1/4 lb Chinese peas|1/2 lb Bok choy (white stemmed cabbage), coarsely chopped|1/2 lb Won bok (celery cabbage); coarsely chopped|1/4 lb Daikon; shredded in long strands|1/4 lb Carrot; shredded in long strands|1/3 cn (15 oz size) bamboo shoots strips|1/4 lb Fresh shiitake mushrooms; sliced|1/3 cn (15 oz size) baby corn|1/4 c Rice vinegar|1/4 c Sesame oil|1/4 c Water|1/4 c Soy sauce|1 tb Sugar|2 Cloves garlic; minced|1 Piece (1/2-inch) ginger root, minced|1 tb Wasabi (horseradish paste)|1 tb Minced Maui onion|1 tb Chopped green onion|Green lettuce leaves|1 Sheet nori; cut into thin strips|1 tb Toasted black and white sesame seed",
    "servings": "1 Servings",
    "instructions": "Blanch Chinese peas, bok choy, and won bok. In a bowl, combine the blanched vegetables with daikon, carrot, bamboo shoots, mushrooms, and corn. To make marinade, combine rice vinegar, sesame oil, water, soy sauce, sugar, garlic, ginger, wasabi, onion, and green onion; mix well. Pour marinade over vegetables and refrigerate for 30 minutes. To serve, place vegetables on lettuce leaves. Top with nori strips and sesame seed. Makes 6 servings. >From I Love Country Cafe"
  },
  {
    "title": "Chinese Chicken Broth [Asian Noodles]",
    "ingredients": "3 1/2 lb Chicken bones; necks, backs, and/or pieces|9 c Water|1 c Chines rice wine OR sake|6 sl Fresh ginger root; lightly pounded, about the size of a quarter",
    "servings": "1 servings",
    "instructions": "1. COmbine the chicken bones, water, rice wine, and ginger in a large pot and bring to a boil. Reduce heat to low and simmer, uncovered, for 1 1/2 hours. Skimming the surface to remove any foam or impurities. 2. Strain the broth through a fine strainer into a bowl or another pot. Skim to remove any fat. (Alternatively, cool and refrigerate the broth and then rove the solidified fat.) Makes about 6 cups."
  },
  {
    "title": "Tropical Asian Curry Paste",
    "ingredients": "1/4 c Peeled; chopped fresh tumeric|(can substitute with 2 tbspns ground|Tumeric)|1/4 c Peeled; chopped galangal|1 c Cilantro stems|1/2 c Peeled; chopped garlic|3 Lemon grass stalks; white part only, chopped|1/2 c Fish sauce; (3 Crab brand)|1/2 c Fresh lime juice|1 c Peeled shallots|1/2 c Toasted Thai bird chiles|5 tb Toasted; coarse-ground coriander seed|2 tb Toasted; coarse-ground cumin seed|2 tb Toasted; coarse-ground black peppercorn|2 tb Kosher salt|2 c Peanut oil|(could substitute with canola oil;|But the taste is far superior with|Lion & Globe brand peanut oil)",
    "servings": "1 servings",
    "instructions": "Using a food processor and a sharp metal blade, puree the tumeric, galangal, cilantro, garlic, lemon grass and lime juice. Make sure a smooth puree is achieved. Add shallots, chiles, spices and salt. While pureeing, drizzle in the oil. Check for seasoning. Can store in refrigerator and will hold at least 2 weeks."
  },
  {
    "title": "Carrot And Red Lentil Soup with Asian Spices",
    "ingredients": "2 oz Unsalted butter|1 1/2 tb Grated fresh ginger|1/4 ts Cayenne pepper|1/4 ts Allspice|1/4 ts Cumin|1/2 ts Curry powder|1/2 ts Ground coriander|2 Onions; finely sliced|1 Parsnip; peeled and diced|1 Stick celery; sliced|2 lb Carrots; peeled and sliced|1 1/2 ts Salt|1/2 ts Ground black pepper|2 oz Red lentils|1 2 ounces lon grain rice|3 1/2 pt Vegetable stock|1/2 pt Unsweetened coconut milk|2 tb Lime juice|Fresh coriander to garnish",
    "servings": "1 servings",
    "instructions": "Melt the butter over a low heat and stir in ginger and spices. Cook for 1 minute. Add the onions, parsnips, celery and carrots. Season with salt and pepper. Cook for 12 minutes over an increasing flame, soften but do not brown. Stir in the lentils and the rice, combine with the vegetables. Add stock and bring to the boil. Simmer for 30 minutes or until vegetables and rice are thoroughly cooked. Liquidize in a blender until smooth. Return soup to the saucepan. Add coconut milk, lime juice and chopped coriander. Check seasoning. Do not reboil, as otherwise it will separate."
  }

===================================================================meditaranian 
{
    "title": "Greek Style Lamb with Mediterranean Vegetables And Pesto",
    "ingredients": "2 sm Lamb mini roasts or 4 rib eye fillets or; (see above) 8 lamb backstrap fillets|2 tb Olive oil|1 Lemon; zest of|2 Cloves garlic; minced|5 Zucchini; diced|1 Red capsicum and 1 yellow capsicum; diced|1 Spanish onion; finely chopped|2 Pontiac potatoes; finely diced, skin on|Juice and zest of 1 lemon|1 c Parsley|1 bn Basil|2 Cloves garlic|1/2 c Pistachio nuts; toasted|1/2 c Parmesan cheese|Olive oil|Salt and pepper to taste",
    "servings": "1 servings",
    "instructions": "Heat the olive oil in a saute pan and add the lemon zest and garlic. Cook for 1 minute to flavour the oil. Add the lamb pieces and sear over high heat until golden. Place in a baking dish and cook at 180c. for 10 minutes. Meanwhile, to the remaining oil in the pan, add the potatoes and onion and saute over high heat for 3 minutes until beginning to colour. Add the diced capsicum, and zucchini and continue cooking for 5 minutes. Add the parsley, juice and zest of lemon and turn heat down to cook slowly until ready to serve. In a food processor, drop all the basil leaves, garlic, nuts and cheese and process until leaves are chopped. With the motor running, pour in a little olive oil until you reach the consistency you like. Do not make the pesto too runny, otherwise it will not hold together on top of the lamb. To serve, mound some vegetables on each plate, remove the lamb from the oven and slice diagonally. Place three or four slices of lamb on the vegetables and top with a good dollop of the basil pesto. Fat; 0 Other Carbohydrates"
  },
  {
    "title": "Green Polenta - Mediterranean",
    "ingredients": "12 oz Greens; (kale, spinach, rocket, flat leaf parsley)|3 Leeks; washed and finely sliced|3 oz Unsalted butter and 6oz extra butter|1 ts Soft thyme leaves|10 oz Polenta flour|3 1/2 pt Chicken stock|6 oz Grated fresh parmesan|6 oz Ripe gorgonzola",
    "servings": "1 servings",
    "instructions": "In a large saucepan cook the leeks in 3oz of the butter until wilted. Add the greens and wilt down. Season. Bring the stock to the boil, lower the heat, reduce to a simmer and slowly add the polenta, stirring with a whisk until completely blended. When thickened, stir in the butter, parmesan, gorgonzola and greens. Season to taste."
  },
  {
    "title": "Mediterranean Baked Chicken Skewers",
    "ingredients": "4 Skinless boneless chicken breast halves|1 1/4 c Dried figs; halved|1/4 c Dry white wine|1/4 c Red wine vinegar|3 tb Extra-virgin olive oil|1 tb Garlic; chopped|1/4 c Capers; chopped fine|1 2/3 tb Dried oregano leaves|1/2 ts Red chili pepper flakes|1/2 ts Salt|2 Bay leaves|1/2 c Dark brown sugar; packed",
    "servings": "12 servings",
    "instructions": "1. Cut chicken into 1-inch cubes. In a mixing bowl, combine the chicken with the figs, wine, vinegar, oil, garlic, capers, oregano, chili pepper flakes, salt and bay leaves. Cover and let marinate for at least 30 minutes or marinate overnight in a ziptop bag. While the chicken marinates (or 30 minutes before you are ready to bake) soak the bamboo skewers in water to keep them from burning in the oven. 2. Preheat oven to 350 degrees F (175 degrees C). Assemble skewers with a piece of chicken and half a fig. Stand skewers up in a casserole dish; spoon the marinade over the chicken and sprinkle with brown sugar. 3. Bake until the sugar topping turns into a golden brown crust and the chicken is white in color throughout, about 40-50 minutes. Serve while hot. Note: This upbeat chicken preparation gains its flavors from both the marinade and the brown sugar topping. Served in bite sized portions, this is a terrific sweet and savory item for parties. Nutrition: Calories 212 Chol 40 mg. Carb. 25 g Protein 16 g Sodium 244 mg Total fat 6 g (25% cff) Found by Kitpath / MC by J Pellegrino / Sent to mc-recipe and eatlf"
  },
  {
    "title": "Mediterranean Barley Salad",
    "ingredients": "1 c Barley|3 c Chicken or Vegetable Broth|1 lg Clove Garlic; minced|3 tb Fresh Parsley; chopped|3 tb Fresh Lemon Juice|2 tb Olive Oil|1 tb Freshly grated Lemon Peel|1/4 ts Salt|1/8 ts Freshly ground Black Pepper|1/8 ts Fennel Seed",
    "servings": "6 servings",
    "instructions": "Rinse the barley thoroughly, then place in a medium saucepan with broth over medium heat. Cover and simmer, stirring occasionally, until barley is tender: about 35 minutes. Add the garlic and cook for 5 minutes more. Transfer the barley-garlic mixture to a fine sieve to drain well. Place in a bowl, cover, and chill completely. When it's time to eat, add parsley, lemon juice, olive oil, lemon peel, salt, pepper, and fennel seed. Toss well to combine, and serve."
  },
  {
    "title": "Mediterranean Black-Eyed Peas",
    "ingredients": "1 2/3 c Dried black-eyed peas|1 c Diced fennel bulb|2 1/2 c Mixed tender leafy greens; packed washed stemmed and roughly cut|1/4 c Extra-virgin olive oil|3/4 c Chopped onion|3 Scallions; finely chopped|1 Sprig fresh cilantro; stemmed and roughly chopped|1 c Grated tomatoes|1 pn Fennel seeds; bruised in a mortar|Salt|Freshly ground black pepper",
    "servings": "7 servings",
    "instructions": "Directions: Soak the black-eyed peas according to package directions. Drain and cook in fresh water to cover until almost tender, about 30 minutes. Meanwhile, wash the fennel and the greens and let sit, dripping wet, on a plate. In a 4-quart saucepan over medium heat, warm the olive oil. Add the onion, scallions, and the fennel and cook until soft, golden, and aromatic, for about 10 minutes. Add 1 cup water and continue to cook, stirring often, for 10 minutes. Add the greens to the saucepan along with the tomatoes, fennel seeds, and salt and pepper and cook for another 10 minutes. Drain the black-eyed peas; discard the water. Add the black-eyed peas to the saucepan along with a few tablespoons water, if necessary, to keep everything moist. Simmer another 10 minutes and correct the seasoning. Serve warm or cool. Serves 6 to 8 GMT RECIPES"
  },
  {
    "title": "Mediterranean Camembert Tartlets",
    "ingredients": "30 ml Waitrose Olive Oil; (2tbsp)|1 md Onion; peeled and finely diced|2 Cloves garlic; peeled and finely diced|1 sm Red pepper; deseeded and cut into thin strips|1 200 g; (7oz) puff pastry|60 ml Waitrose Tomato Pure; (4tbsp)|60 ml Fresh basil; shredded (4tbsp)|4 md Tomatoes; thinly sliced|250 g Camembert Le Rustique; thinly sliced (9oz)|12 Black olives|Salt and freshly ground black pepper",
    "servings": "4 servings",
    "instructions": "Heat the oil in a frying pan, add the onion, garlic and red pepper and gently cook until softened. To make the tartlet bases, roll out the pastry on a floured worksurface, cut out four 17.5cm (7\") circles and place on a greased baking sheet. Evenly cover each base with the tomato pure, followed by the onion mixture, basil and tomatoes. Cover each with the Camembert Le Rustique, arrange the olives on top and season with salt and pepper. Place in a preheated oven at 230ºF, 450ºF, gas mark 8 for 12 minutes or until cooked. Hints and Tips for Camembert Le Rustique: Simply remove the Camembert Le Rustique from box and pop into a heat proof serving dish, sprinkle a good handful of finely chopped coriander on top and cover. Place in a hot oven for approximately 30 minutes. Serve with warmed pitta bread or potato wedges. NOTES : The combination of the Mediterranean flavours of red pepper, and olives, together with the soft, full-flavoured Camembert Le Rustique on a puff pastry base, makes this delicious tartlet a meal in itself. Just add a crisp fresh salad and some garlic bread to serve."
  },
  {
    "title": "Mediterranean Chicken Parcels",
    "ingredients": "4 Chicken breasts|1 Bottle Rosemary and Garlic Marinade|1 pk Asparagus spears|1 pk Mozarella cheese; sliced|4 sl Parma ham|100 g Flour*|2 Eggs; beaten|Tuscan olive oil|1 Jar Creamy Red Pepper Sauce|Salt and pepper*|Chopped fresh parsley; to garnish",
    "servings": "4 servings",
    "instructions": "1. Slice the chicken breast almost in half horizontally, and place in a dish. Pour over about two thirds of the marinade, fully coating the meat, and leave for 30 minutes. 2. Meanwhile, cook the asparagus according to the packet instructions; set aside and keep warm. 3. Remove the chicken breast from the marinade and place a slice of mozzarella inside each. Wrap each breast in a slice of ham and secure with a wooden cocktail stick. 4. Place the flour and beaten eggs into two separate bowls. Dip the chicken parcels first in the flour, then in the egg. Fry gently over a low heat in a little olive oil for about ten minutes on each side. 5. Finally, heat up the Creamy Red Pepper Sauce according to the instructions on the jar. 6. To serve, remove the cocktail sticks and slice the chicken parcels into four. Lay four slices on each plate, and pour the pepper sauce around. Add a serving of asparagus, season and garnish NOTES : A truly continental dish with light, marinated chicken, Parma ham and a creamy red pepper sauce."
  },
  {
    "title": "Mediterranean Chicken with Salsa",
    "ingredients": "3/4 c Salsa|1/3 c Plum Tomatoes; Diced|1/3 c Zuch; Diced|2 tb Ripe Olives; Chopped|2 ts Capers|4 Boneless Skinless Chicken Breast Halves|2 tb Italian Bread Crumbs|2 ts Olive Oil|2 tb Water|Black And Green Olives; Optional",
    "servings": "4 servings",
    "instructions": "Combine the first 5 ingredients in a bowl, and set aside. Sprinkle chicken with breadcrumbs. Heat oil in a large nonstick skillet over medium-high heat until hot. Add chicken, and cook 2 minutes on each side or until hot. Reduce heat to low; add water. Cover and cook 8 minutes or until chicken is done. Serve with salsa mixture; garnish with black and green olives, if desired."
  },
  {
    "title": "Mediterranean Crostini",
    "ingredients": "1 sm Baguette; cut into eight 1cm ( 1/2 \") slices and toasted|Waitrose Extra Virgin Olive Oil|1/2 Clove garlic|125 g Waitrose Mixed Antipasti; (4 1/2oz)|75 g Feta cheese; (2 3/4oz)",
    "servings": "1 servings",
    "instructions": "Brush each slice of toast with a little olive oil and rub lightly with the garlic. Roughly chop the antipasti, crumble the feta and mix together. Divide between the slices of bread and serve. NOTES : Makes 8"
  },
  {
    "title": "Mediterranean Dip",
    "ingredients": "2 tb Vegetable oil|2 Green peppers, chopped|2 c Sliced fresh mushrooms|1 cn (7.5 oz.) Solid Light Tuna, drained and flaked|1 Jar (313 ml) roasted red peppers, drained and thinly sliced|1/2 c Each pitted ripe olives and stuffed manzanilla olives, sliced|1 cn (14 oz.) tomato sauce|1/2 c Chili sauce|1/2 c White vinegar|2 Bay leaves|Pinch ground cinnamon",
    "servings": "6 Cups",
    "instructions": "Heat oil in a saucepan over medium-high heat. Add green peppers and mushrooms; cook 3-5 minutes or until soft. Add tuna, roasted red peppers, olive, tomato sauce, chili sauce, vinegar, bay leaves and cinnamon. Bring to a boil over medium high heat."
  }

===============================================================Spicy Mexican:
 {  
    "title": "Spicy Mexican Bean Burger #1",
    "ingredients": "1 cn (16-oz) red kidney beans; drained and mashed|1/2 sm Onion; coarsely chopped|1/2 Green pepper; coarsely chopped|1 Carrot; steamed, mashed|1/8 c Picante sauce or salsa|1 c Bread crumbs|1/2 c Flour|1 ts Black pepper or to taste|1 ds Chili powder",
    "servings": "8 Servings",
    "instructions": "Mix all ingredients together. Add more flour to create a firmer mixture, or more salsa if mixture is too stiff. Form into balls and smash into patties. Bake at 450 degrees for 15-20 minutes, until firm, brown and done. Serve on a whole wheat bun with lettuce, tomato and salsa. Accompany with tortilla chips and a large glass of iced tea. These can be grilled or pressed in those new-fangled sandwich presses... a lot quicker and tastier than baking. The judges suggested adding 1/2 teaspoon of salt to the recipe. (GARRY HOWARD)"
  },
  {
    "title": "Spicy Mexican Bean Salad",
    "ingredients": "1 Red onion, sliced|1/4 c Water|1 tb Chili powder|2 c Cooked green beans|1 15oz can black beans, drained & rinsed|1 15oz can red kidney beans, drained & rinsed|1 15oz can white beans, drained & rinsed|1 1/2 c Frozen corn kernals, thawed|2 tb Chopped cilantro or parsley Chili-Cilantro Dressing (recipe following)",
    "servings": "4 Servings",
    "instructions": "Place the onion in a saucepan with the water. Cook gently until the onion is soft and separated into rings, 4 to 5 min. Add the chili powder and stir until well mixed. Remove from heat. Combine all of the ingredients in a large bowl and toss to mix well. Cover and chill for 1 to 2 hours to allow flavors to blend. (I left out the chili powder-ac)"
  },
  {
    "title": "Spicy Mexican Chicken Halves",
    "ingredients": "8 oz Tomato sauce|1 tb Chopped fresh parsley|1 tb Sugar|1/2 ts Salt|1/2 ts Chili powder|1/8 ts Pepper|1/8 ts Red pepper sauce|2 Broiler fryer chickens (2 to 2 1/2 pounds each), cut in half",
    "servings": "1 Servings",
    "instructions": "Mix all ingredients except chicken. Grill chicken halves, bone sides down, 5 inches from medium coals 20 to 30 minutes; turn chicken. Grill 30 to 40 minutes longer, turning and brushing Frequently with tomato mixture, until done. 4 servings. 1 serving Percent of U S. RDA Calories 835 Protein 26% Protein g 93 Vitamin A 100% Carbohydrate g 7 Vitamin C 20% Fat. g 46 Thiamin 14% Cholesterol 860 Niacin 100% Potassium mg 950 Calcium 6% Iron 30%"
  },
  {
    "title": "Spicy Mexican Fondue",
    "ingredients": "1 cn (15.5-oz) refried beans|1/2 lb Grated cheddar cheese|2 tb Butter|2 tb Minced scallion|1 Clove garlic; minced|1/2 ts Worcestershire sauce|1 Cayenne pepper; seeded and chopped|1 Seeded and chopped anaheim or poblano pepper|3/4 c Beer at room temperature",
    "servings": "8 Servings",
    "instructions": "From a pamplet I got from Shepard's seeds. Combine all the ingredients except the beer in a heavy saucepan. Heat, stirring, until mixture is heated thoroughly, 10 to 15 minutes. Add beer gradually, stirring, Transfer to a fondue pot. Accompany with tortilla chips or fresh vegetables for dipping. /MISC"
  },
  {
    "title": "Spicy Mexican Pickled Vegetables",
    "ingredients": "12 Garlic cloves|1 md Onion; cut in wedges|3/4 c Olive oil|4 md Carrots - scraped, thinly sliced|1 ts Black peppercorns|1 1/2 c Vinegar Water|1/2 cn Whole pickled jalapenos - drained (7 oz. can)|1 md Cauliflower; in flowerets|3 tb Salt|3 md Zucchini; thinly sliced|12 sm Bay leaves|3/4 ts Dried whole marjoram|3/4 ts Dried whole oregano|3/4 ts Dried whole thyme|7 oz Pickled baby corn on cob - drained (1 jar)|6 oz Can pitted small ripe olives - drained",
    "servings": "12 Servings",
    "instructions": "Saute garlic and onion in hot oil in a large Dutch oven for 3 minutes. Add carrots and peppercorns; saute 5 minutes. Add vinegar; cover, reduce heat and simmer for 3 minutes. Stir in water and jalapenos; cover and bring mixture to a boil. Add cauliflower and salt, stirring well; cover, reduce heat to medium and cook 5 minutes. Add zucchini, bay leaves, marjoram, oregano and thyme, stirring well; cook 2 minutes. Remove from heat; stir in corn and olives. Transfer mixture to a large container; cover tightly and chill at least 8 hours. Remove and discard bay leaves before serving."
  },
  {
    "title": "Spicy Mexican Rice",
    "ingredients": "Vegetable cooking spray|1 ts Vegetable oil|1/2 c Uncooked long-grain rice|1/2 c Chopped onion|1 c Chopped tomato|1/3 c Chopped green pepper|1/4 ts Garlic powder|1/4 ts Ground red pepper|1/2 ts Chili powder|1 ts Beef-flavored bouillon granules (up to)|1 1/4 c Water",
    "servings": "5 Servings",
    "instructions": "Coat a large skillet with cooking spray; add oil, and place over medium heat. Add rice and onion; saute about 3 minutes, stirring occasionally. Add remaining ingredients; bring to a boil. Cover, reduce heat, and simmer 25 minutes or until tender. Yields 5 servings, 95 calories each. MAGAZINE ARTICLE SUSIE M. E. DENT SALTILLO, MS"
  },
  {
    "title": "Spicy Mexican Salad",
    "ingredients": "2 pk Wagon Wheel pasta|1 sm Can corn, or frozen|1 cn Mexican beans|1/2 c Picante sauce, mild|1/4 c Diced onion|1/2 c Celery, chopped|1/2 c Shredded cheese|1 Crushed red peppers|1/4 ts Salt and pepper to taste|1 cn (small) tomato sauce|1 Bottle Italian dressing|1 sm Can chopped black olives",
    "servings": "1 Servings",
    "instructions": "Cook noodles to tenderness; rinse and drain. Combine all ingredients and refrigerate for 2 to 3 hours."
  },
  {
    "title": "Spicy Mexican Tofu",
    "ingredients": "1 lg Onion; chopped|2 Garlic clove|1 ts Oil|1 tb Chili powder|1 c Tofu; cubed|1 c Kidney beans; canned",
    "servings": "2 -3 serving",
    "instructions": "Saute onion and garlic in oil until soft. Add tomatoes and chili powder and bring to boil. Boil vigorously, uncovered and stirring often, until thick, about 8 mins. Stir in tofu and add kidney beans and just heat through."
  },
  {
    "title": "Spicy Mexican Torte",
    "ingredients": "1/2 lb Chorizo sausage -- Casings|Removed|2 md Onions -- chopped|1 Cup)|2 cl Garlic -- finely chopped|1 cn (4 ounces) chopped green --|Chilis, drained|8 ts Flour tortillas*|2 c Shredded monterey jack or --|Hot pepper cheese (8|1 cn (16 ounces) refried beans|1 Jars (7 ounces) roasted red|Peppers, drained",
    "servings": "8 Servings",
    "instructions": "*substitute: 16 Six-inch corn tortillas for Flour tortillas. overlap 4 Tortillas for each layer. Cook sausage, onions and garlic in 10-inch skillet over medium heat, stirring occasionally, until sausage is done; drain. Stir in green chilies; set aside.Heat oven to 400 degrees. Grease pie plate, 10 X 1-1/2 inches. Place 2 tortillas in pie plate. Spread half of the sausage mixture over tortillas. Sprinkle with half of the cheese. Place 2 tortillas on cheese. Spread with beans. Place 2 tortillas on beans and place peppers on tortillas. Place 2 tortillas on peppers. Spread with remaining sausage mixture. Sprinkle with remaining cheese. Cover and bake 40 minutes. Uncover and bake 15 minutes or until cheese is melted and center is hot. Cool 10 minutes before cutting. Serve with salsa, sour cream or Guacamole if desired. 8 SERVINGS; 350 CALORIES PER SERVING. :"
  },
  {
    "title": "Spicy Mexican Tortilla Stacks",
    "ingredients": "1 cn Pinto Beans (15oz), drained, rinsed|1 cn Black Beans (15oz), drained, rinsed|1 cn Corn (16oz)|1 cn Chopped Green Chilies (4oz)|1 lg Onion, chopped|1 lg Green Pepper, chopped|5 Flour Tortillas|1 c Monterey Cheese, pre-shredded|1 c Cheddar Cheese, pre-shredded|1 lg Jar Salsa",
    "servings": "4 Servings",
    "instructions": "Preheat oven 425\". Combine beans and corn in large bowl. Stir in chilies, onion and green pepper. Lay one tortilla at the bottom of a greased two-quart souffle or casserole dish. Spoon a small amount of bean mixture over tortilla. Top with equal amounts of Moterey Jack and cheddar cheese. Continue alternating layers of tortilla, bean mixture and cheese mixture until you end with cheese layer. Bake covered at 425\" for 10 minutes. Serve with salsa. ** -=> this comes from the bottom of the files of Shelley Rodgers <=-"
  }

=================================================================Middle Eastern

{
   
    "title": "Middle Eastern Chicken",
    "ingredients": "1 tb Vegetable oil|4 Boneless and skinless chicken breast halves|1 cn Sliced black olives; drained (2.75 ounces)|2/3 c Apricot preserves|1 tb Lemon juice|1/2 ts Ground ginger|1/2 ts Ground cinnamon|1/2 ts Salt",
    "servings": "1 servings",
    "instructions": "In a large skillet, heat the oil over medium heat; add the chicken breasts and cook for 3 to 5 minutes per side, until browned on both sides. Meanwhile, in a small bowl, combine the remaining ingredients. Pour the mixture over the chicken and reduce the heat to low. Cook for 15 to 20 minutes, or until no pink remains in the chicken and the juices run clear, turning the chicken occasionally. NOTE: Serve over steamed rice or, for a real Moroccan dish, couscous. NOTES : 4 servings"
  },
  {
    "title": "Middle Eastern Chickpeas",
    "ingredients": "2 10 Oz Bags Fresh Spinach|2 tb Olive Oil|1 lg Onion; chopped|3 Garlic Cloves; minced|3 1/2 c Cooked; Or 2-15 Oz Cans Chickpeas|1 c Peeled And Seeded And Diced Tomatoes|1/4 c Tomato Paste|1/4 ts Salt|1/4 ts Freshly Ground Black Pepper",
    "servings": "6 servings",
    "instructions": "Remove stems and rinse spinach. Cut spinach into thin strips. Set aside. Heat the oil in a large, nonstick skillet over medium heat. Add the onion and garlic and cook, stirring occasionally until onion is translucent, about 3-4 minutes. Drain liquid from chickpeas and add 1 cup drained liquid to the onion mixture. Stir in tomatoes, tomato paste, salt and pepper and bring to a boil. Stir in spinach until wilted. Stir in drained chickpeas. Simmer, covered, 25 minutes or until vegetables are tender."
  },
  {
    "title": "Middle Eastern Herb Salad",
    "ingredients": "60 g Cracked wheat; (bulgar or burgul) or couscous|A large pinch of saffron strands|150 ml Hot water|1 bn Parsley|1 sm Bunc mint|1 sm Bunc coriander|200 g Dried chickpeas; soaked overnight and cooked or 400g/14oz tin cooked chickpeas, well drained|Finely grated zest and juice of 1 lemon|1/2 Red chilli; deseeded, finely chopped|250 g Tomatoes; deseeded, finely diced|1 ts Cinnamon|6 tb Extra virgin olive oil|2 Cloves garlic; crushed|Salt and pepper",
    "servings": "8 servings",
    "instructions": "1 Put the cracked wheat or couscous in a bowl with the saffron and pour over the water. Stir, leave for 20-30 minutes to swell and soften. Drain off any water that has not been absorbed. 2 Finely chop the leaves off the mint, parsley and coriander. Mix into the cracked wheat or couscous with the remaining ingredients, cover and chill in the fridge for a few hours or overnight, to allow the flavours to blend, and the leaves to soften. 3 Stir again, taste and adjust the seasoning. Serve as a first course with good bread, or as an accompaniment."
  },
  {
    "title": "Middle Eastern Lamb And Courgette Gratin",
    "ingredients": "1 Onion; sliced|1 Garlic cloves; chopped finely, up to 2|3 tb Olive oil|1/4 ts Ground cinnamon|1/4 ts Allspice|300 g Minced lamb; (10oz)|1 397 gram can chopped tomatoes; (14oz)|300 g Courgettes; sliced (10oz)|175 g Conchiglie; (6oz)|50 g Parmesan cheese; grated (2oz)|Salt and pepper",
    "servings": "4 servings",
    "instructions": "1. Preheat the oven to Gas Mark 6/200 øC/400 øF. 2. Fry the onion and garlic in the oil for 5 minutes. 3. Add the spices and cook for 1 minute. 4. Add the lamb and cook for 5 minutes. 5. Add the tomatoes and courgettes and season. 6. Simmer for 10 minutes. 7. Cook the pasta in boiling salted water, according to the packet instructions. 8. Drain. 9. Mix the pasta with the meat mixture and transfer to a 1.2 litre (2 pint) greased ovenproof dish. 10. Sprinkle with the grated parmesan. 11. Bake in the oven for 10 minutes. 12. Brown under a hot grill for 2-3 minuets before serving. NOTES : A delicious Eastern pasta dish."
  },
  {
    "title": "Middle Eastern Roast Lamb or Turkey (Shawarma)",
    "ingredients": "2 Cloves garlic; crushed|1 tb Salt|1/2 ts Ground black pepper|1/2 ts Ground cinnamon or cumin|1/8 ts Grated nutmeg|1/8 ts Ground cloves|1 pn Cayenne pepper|1/4 c Water|2 tb Fresh lemon juice|1 tb White vinegar|1 Olive oil|1 sm Onion; chopped, (about 1/4 cup)|1/2 Lemon; sliced|5 lb Lamb shoulder or turkey; cut into 1/4-inch-thick slices",
    "servings": "10 Servings",
    "instructions": "1. Combine the garlic, salt, black pepper, cinnamon, nutmeg, cloves, and cayenne. Stir in the water, lemon juice, vinegar, oil, onion and lemon slices. Rub the marinade over the meat, place in the refrigerator and let stand overnight. 2. Remove meat from the refrigerator and let come to room temperature. 3. Preheat an outdoor grill, preferable with a rotisserie, or an electric rotisserie. 4. Stack the slices of meat, placing the larger pieces on the bottom, on a spit. Place the spit on the rotisserie or grill and roast. 5. As the exterior of the meat browns, slice it off across the outside, cutting through all the layers to create shreds. Return the spit to the grill and continue browning and slicing the cooked meat. Wrap the strips of meat in lavash or stuff into a pita, adding, if desired, any combination of shredded lettuce, chopped tomatoes, chopped onions and pitted olives."
  },
  {
    "title": "Swordfish Steaks W/middle Eastern Flavor",
    "ingredients": "2 8 oz. swordfish steaks; about 3/4-inch thick|2 tb Finely chopped fresh parsley (up to)|2 Minced Jalapeno or other hot peppers (chile heads see note; below)!|4 ts Vegetable oil|3 tb Fresh lemon juice|1 Clove garlic; minced|1 ts Ground turmeric|1 ts Ground cinnamon|1 ts Ground cumin|Salt and freshly ground black pepper to taste",
    "servings": "2 Servings",
    "instructions": "(adapted from Eating Well magazine) Place swordfish steaks in a shallow glass dish. In a small bowl, combine all remaining ingredients. Spread mixture over both sides of fish. Cover and refrigerate for 1 hour. Prepare a charcoal fire or preheat gas grill. Once the fire is at medium heat, grill the steaks for 4 to 5 minutes per side. The flesh should be opaque. Remove from the grill. Cut each steak into two portions and serve. Serves 4. 167 calories per serving: 19 G protein, 9 G fat, 3 G carbohydrate, 89 MG sodium, 38 mg cholesterol. Dots notes: I've made this using swordfish or yellowfin tuna. I always double the number of hot peppers (usually several large jalapenos or lots of small serranos) and the garlic. I serve this with Chardonnay or Sauvignon Blanc, vegetable, salad or slaw, & couscous or rice. Try to avoid getting the turmeric on the counter top (it stains)! Enjoy!"
  },
  {
    "title": "Ful (Middle Eastern Fava Bean Salad)",
    "ingredients": "1 lb (about 2 cups) dried fava beans (see Note below)|3 qt Water|1/3 c Olive or vegetable oil|1 ts Salt, about|Ground black pepper to taste|6 lg Eggs in shell, washed well (up to 8)|1/4 c Lemon juice, about|1/3 c Chopped fresh parsley",
    "servings": "6 To 8",
    "instructions": "The World Of Jewish Cooking, Gil Marks Ful is the Arabic word for 'fava beans'. This dish is also called salat lubiya (bean salad). Although fava bean salads, inexpensive and flavorful, are commonplace throughout the Near East and North Africa, the eggs are a distinctive Jewish touch. Serve ful as a salad, side dish, or part of a meze (appetizer assortment). Soak the beans in water to cover overnight. Drain. Place the beans in a 4-quart saucepan and add the 3 quarts of water. Bring to a boil, cover, reduce the heat to medium, stirring occasionally for 30 minutes. Stir in the oil, salt, and pepper. Add the eggs. Reduce the heat to low and simmer, stirring occasionally and adding ore water if necessary, until the beans are very tender,about 2 hours. Remove the eggs, peel, and chop or quarter. Add the lemon juice and parsley to the beans, tossing to coat. Divide among serving bowls and top with the eggs. Serve warm or chilled. Note: Dried fava beans are available in Middle Eastern and Italian groceries and in some specialty food stores. Since fava beans are sometimes hard to find, dried white beans, large dried lima beans, or chickpeas can be substituted. VARIATIONS: PUL MEDAMES (Sephardic Baked Fava Beans Cook the beans and eggs, covered, overnight over very lowheat and serve on Sabbath morning for desayuno (breakfast)). When simmered overnight this dish becomes a Sabbath stew similar to hamin. SYRIAN FUL Add 1-1/2 teaspoons ground cumin and 1/4 to 1/2 teaspoon hot red pepper flakes or a pinch of cayenne. YEMENITE FUL Spoon 2 tablespoons tarator bi tahina (sesame seed sauce) over each serving of beans. Note: To make tarator bi tahina (yield 1-1/3 cups)"
  },
  {
    "title": "Middle Eastern Bean and Roasted Vegetable Salad (Mf)",
    "ingredients": "15 oz Chick peas and small red kidney beans|2 c Couscous|2 1/2 c Salted boiling water|2 tb Tahini paste|1 Clove garlic, minced|1 ts Ground cumin|1 ts Ground coriander|1/2 c Plain nonfat yogurt|1/2 c Packed parsley leaves|1 tb Olive oil|1 ts Grated lemon zest|2 tb Lemon juice|Salt and freshly ground black pepper|1/2 c Walnuts, toasted and chopped|Mixed greens such as: torn escarole, watercress and boston lettuce, lightly tossed with a salad dressing of choice|Grilled or roasted vegetables to taste, roughly chopped|1/2 c Roasted peppers, cut into a fine julienne",
    "servings": "6 Servings",
    "instructions": "Chill the chick peas and beans for as long as possible. Steep couscous in boiling salted water. In a blender or food processor or by hand, blend until smooth the tahini paste, garlic, cumin, coriander, lowfat yogurt, parsley, olive oil, grated lemon zest and juice. Season to taste with salt and pepper and transfer to a mixing bowl. Add the chilled beans to the dressing and walnuts. Fluff up the couscous with a fork and add to beans and walnuts; toss the ingredients together and adjust the seasoning. On each dinner plate make an outer wreath of dressed greens, an inner wreath of mixed grilled vegetables of choice and center couscous and chick peas in the middle. Garnish top with roasted red peppers"
  },
  {
    "title": "Middle Eastern Black Bean Salad",
    "ingredients": "----SALAD------|3 1/2 c Cooked, Drained Black Beans|(1 cup dry)|1/2 c Red Onion -- finely diced|1 lg Tomato -- seeded and diced|1 sm Green Pepper -- seeded and|Diced|1 md Cucumber -- seeded and|Diced|1/2 c Chopped Parsley|1 tb Chopped Fresh Mint ----DRESSING------|1/4 c Lemon Juice|1 ts Cumin|1/4 ts Salt -- (or to taste)|1/4 ts Pepper|1/4 c Olive Oil",
    "servings": "6 Servings",
    "instructions": "Combine salad ingredients together and toss lightly. For dressing, add spices to the lemon juice and beat in oil. Pour over salad and chill for several hours. :"
  },
  {
    "title": "Middle Eastern Carrot Salad",
    "ingredients": "4 c Grated carrots|3 tb Fresh lemon juice|3 tb Vegetable oil|1/2 ts Ground coriander|1/4 ts Salt|2 ts Chopped fresh mint|1 tb Chopped fresh parsley|1 ts Sugar or maple syrup",
    "servings": "4 Servings",
    "instructions": "Mix all ingredients together & chill at least one hour before serving."
  }
