
===============================================================Spicy Mexican:
 {  
    "title": "Spicy Mexican Bean Burger #1",
    "ingredients": "1 cn (16-oz) red kidney beans; drained and mashed|1/2 sm Onion; coarsely chopped|1/2 Green pepper; coarsely chopped|1 Carrot; steamed, mashed|1/8 c Picante sauce or salsa|1 c Bread crumbs|1/2 c Flour|1 ts Black pepper or to taste|1 ds Chili powder",
    "servings": "8 Servings",
    "instructions": "Mix all ingredients together. Add more flour to create a firmer mixture, or more salsa if mixture is too stiff. Form into balls and smash into patties. Bake at 450 degrees for 15-20 minutes, until firm, brown and done. Serve on a whole wheat bun with lettuce, tomato and salsa. Accompany with tortilla chips and a large glass of iced tea. These can be grilled or pressed in those new-fangled sandwich presses... a lot quicker and tastier than baking. The judges suggested adding 1/2 teaspoon of salt to the recipe. (GARRY HOWARD)"
  },
  {
    "title": "Spicy Mexican Bean Salad",
    "ingredients": "1 Red onion, sliced|1/4 c Water|1 tb Chili powder|2 c Cooked green beans|1 15oz can black beans, drained & rinsed|1 15oz can red kidney beans, drained & rinsed|1 15oz can white beans, drained & rinsed|1 1/2 c Frozen corn kernals, thawed|2 tb Chopped cilantro or parsley Chili-Cilantro Dressing (recipe following)",
    "servings": "4 Servings",
    "instructions": "Place the onion in a saucepan with the water. Cook gently until the onion is soft and separated into rings, 4 to 5 min. Add the chili powder and stir until well mixed. Remove from heat. Combine all of the ingredients in a large bowl and toss to mix well. Cover and chill for 1 to 2 hours to allow flavors to blend. (I left out the chili powder-ac)"
  },
  {
    "title": "Spicy Mexican Chicken Halves",
    "ingredients": "8 oz Tomato sauce|1 tb Chopped fresh parsley|1 tb Sugar|1/2 ts Salt|1/2 ts Chili powder|1/8 ts Pepper|1/8 ts Red pepper sauce|2 Broiler fryer chickens (2 to 2 1/2 pounds each), cut in half",
    "servings": "1 Servings",
    "instructions": "Mix all ingredients except chicken. Grill chicken halves, bone sides down, 5 inches from medium coals 20 to 30 minutes; turn chicken. Grill 30 to 40 minutes longer, turning and brushing Frequently with tomato mixture, until done. 4 servings. 1 serving Percent of U S. RDA Calories 835 Protein 26% Protein g 93 Vitamin A 100% Carbohydrate g 7 Vitamin C 20% Fat. g 46 Thiamin 14% Cholesterol 860 Niacin 100% Potassium mg 950 Calcium 6% Iron 30%"
  },
  {
    "title": "Spicy Mexican Fondue",
    "ingredients": "1 cn (15.5-oz) refried beans|1/2 lb Grated cheddar cheese|2 tb Butter|2 tb Minced scallion|1 Clove garlic; minced|1/2 ts Worcestershire sauce|1 Cayenne pepper; seeded and chopped|1 Seeded and chopped anaheim or poblano pepper|3/4 c Beer at room temperature",
    "servings": "8 Servings",
    "instructions": "From a pamplet I got from Shepard's seeds. Combine all the ingredients except the beer in a heavy saucepan. Heat, stirring, until mixture is heated thoroughly, 10 to 15 minutes. Add beer gradually, stirring, Transfer to a fondue pot. Accompany with tortilla chips or fresh vegetables for dipping. /MISC"
  },
  {
    "title": "Spicy Mexican Pickled Vegetables",
    "ingredients": "12 Garlic cloves|1 md Onion; cut in wedges|3/4 c Olive oil|4 md Carrots - scraped, thinly sliced|1 ts Black peppercorns|1 1/2 c Vinegar Water|1/2 cn Whole pickled jalapenos - drained (7 oz. can)|1 md Cauliflower; in flowerets|3 tb Salt|3 md Zucchini; thinly sliced|12 sm Bay leaves|3/4 ts Dried whole marjoram|3/4 ts Dried whole oregano|3/4 ts Dried whole thyme|7 oz Pickled baby corn on cob - drained (1 jar)|6 oz Can pitted small ripe olives - drained",
    "servings": "12 Servings",
    "instructions": "Saute garlic and onion in hot oil in a large Dutch oven for 3 minutes. Add carrots and peppercorns; saute 5 minutes. Add vinegar; cover, reduce heat and simmer for 3 minutes. Stir in water and jalapenos; cover and bring mixture to a boil. Add cauliflower and salt, stirring well; cover, reduce heat to medium and cook 5 minutes. Add zucchini, bay leaves, marjoram, oregano and thyme, stirring well; cook 2 minutes. Remove from heat; stir in corn and olives. Transfer mixture to a large container; cover tightly and chill at least 8 hours. Remove and discard bay leaves before serving."
  },
  {
    "title": "Spicy Mexican Rice",
    "ingredients": "Vegetable cooking spray|1 ts Vegetable oil|1/2 c Uncooked long-grain rice|1/2 c Chopped onion|1 c Chopped tomato|1/3 c Chopped green pepper|1/4 ts Garlic powder|1/4 ts Ground red pepper|1/2 ts Chili powder|1 ts Beef-flavored bouillon granules (up to)|1 1/4 c Water",
    "servings": "5 Servings",
    "instructions": "Coat a large skillet with cooking spray; add oil, and place over medium heat. Add rice and onion; saute about 3 minutes, stirring occasionally. Add remaining ingredients; bring to a boil. Cover, reduce heat, and simmer 25 minutes or until tender. Yields 5 servings, 95 calories each. MAGAZINE ARTICLE SUSIE M. E. DENT SALTILLO, MS"
  },
  {
    "title": "Spicy Mexican Salad",
    "ingredients": "2 pk Wagon Wheel pasta|1 sm Can corn, or frozen|1 cn Mexican beans|1/2 c Picante sauce, mild|1/4 c Diced onion|1/2 c Celery, chopped|1/2 c Shredded cheese|1 Crushed red peppers|1/4 ts Salt and pepper to taste|1 cn (small) tomato sauce|1 Bottle Italian dressing|1 sm Can chopped black olives",
    "servings": "1 Servings",
    "instructions": "Cook noodles to tenderness; rinse and drain. Combine all ingredients and refrigerate for 2 to 3 hours."
  },
  {
    "title": "Spicy Mexican Tofu",
    "ingredients": "1 lg Onion; chopped|2 Garlic clove|1 ts Oil|1 tb Chili powder|1 c Tofu; cubed|1 c Kidney beans; canned",
    "servings": "2 -3 serving",
    "instructions": "Saute onion and garlic in oil until soft. Add tomatoes and chili powder and bring to boil. Boil vigorously, uncovered and stirring often, until thick, about 8 mins. Stir in tofu and add kidney beans and just heat through."
  },
  {
    "title": "Spicy Mexican Torte",
    "ingredients": "1/2 lb Chorizo sausage -- Casings|Removed|2 md Onions -- chopped|1 Cup)|2 cl Garlic -- finely chopped|1 cn (4 ounces) chopped green --|Chilis, drained|8 ts Flour tortillas*|2 c Shredded monterey jack or --|Hot pepper cheese (8|1 cn (16 ounces) refried beans|1 Jars (7 ounces) roasted red|Peppers, drained",
    "servings": "8 Servings",
    "instructions": "*substitute: 16 Six-inch corn tortillas for Flour tortillas. overlap 4 Tortillas for each layer. Cook sausage, onions and garlic in 10-inch skillet over medium heat, stirring occasionally, until sausage is done; drain. Stir in green chilies; set aside.Heat oven to 400 degrees. Grease pie plate, 10 X 1-1/2 inches. Place 2 tortillas in pie plate. Spread half of the sausage mixture over tortillas. Sprinkle with half of the cheese. Place 2 tortillas on cheese. Spread with beans. Place 2 tortillas on beans and place peppers on tortillas. Place 2 tortillas on peppers. Spread with remaining sausage mixture. Sprinkle with remaining cheese. Cover and bake 40 minutes. Uncover and bake 15 minutes or until cheese is melted and center is hot. Cool 10 minutes before cutting. Serve with salsa, sour cream or Guacamole if desired. 8 SERVINGS; 350 CALORIES PER SERVING. :"
  },
  {
    "title": "Spicy Mexican Tortilla Stacks",
    "ingredients": "1 cn Pinto Beans (15oz), drained, rinsed|1 cn Black Beans (15oz), drained, rinsed|1 cn Corn (16oz)|1 cn Chopped Green Chilies (4oz)|1 lg Onion, chopped|1 lg Green Pepper, chopped|5 Flour Tortillas|1 c Monterey Cheese, pre-shredded|1 c Cheddar Cheese, pre-shredded|1 lg Jar Salsa",
    "servings": "4 Servings",
    "instructions": "Preheat oven 425\". Combine beans and corn in large bowl. Stir in chilies, onion and green pepper. Lay one tortilla at the bottom of a greased two-quart souffle or casserole dish. Spoon a small amount of bean mixture over tortilla. Top with equal amounts of Moterey Jack and cheddar cheese. Continue alternating layers of tortilla, bean mixture and cheese mixture until you end with cheese layer. Bake covered at 425\" for 10 minutes. Serve with salsa. ** -=> this comes from the bottom of the files of Shelley Rodgers <=-"
  }

=================================================================Middle Eastern

{
    "title": "Middle Eastern Chicken",
    "ingredients": "1 tb Vegetable oil|4 Boneless and skinless chicken breast halves|1 cn Sliced black olives; drained (2.75 ounces)|2/3 c Apricot preserves|1 tb Lemon juice|1/2 ts Ground ginger|1/2 ts Ground cinnamon|1/2 ts Salt",
    "servings": "1 servings",
    "instructions": "In a large skillet, heat the oil over medium heat; add the chicken breasts and cook for 3 to 5 minutes per side, until browned on both sides. Meanwhile, in a small bowl, combine the remaining ingredients. Pour the mixture over the chicken and reduce the heat to low. Cook for 15 to 20 minutes, or until no pink remains in the chicken and the juices run clear, turning the chicken occasionally. NOTE: Serve over steamed rice or, for a real Moroccan dish, couscous. NOTES : 4 servings"
  },
  {
    "title": "Middle Eastern Chickpeas",
    "ingredients": "2 10 Oz Bags Fresh Spinach|2 tb Olive Oil|1 lg Onion; chopped|3 Garlic Cloves; minced|3 1/2 c Cooked; Or 2-15 Oz Cans Chickpeas|1 c Peeled And Seeded And Diced Tomatoes|1/4 c Tomato Paste|1/4 ts Salt|1/4 ts Freshly Ground Black Pepper",
    "servings": "6 servings",
    "instructions": "Remove stems and rinse spinach. Cut spinach into thin strips. Set aside. Heat the oil in a large, nonstick skillet over medium heat. Add the onion and garlic and cook, stirring occasionally until onion is translucent, about 3-4 minutes. Drain liquid from chickpeas and add 1 cup drained liquid to the onion mixture. Stir in tomatoes, tomato paste, salt and pepper and bring to a boil. Stir in spinach until wilted. Stir in drained chickpeas. Simmer, covered, 25 minutes or until vegetables are tender."
  },
  {
    "title": "Middle Eastern Herb Salad",
    "ingredients": "60 g Cracked wheat; (bulgar or burgul) or couscous|A large pinch of saffron strands|150 ml Hot water|1 bn Parsley|1 sm Bunc mint|1 sm Bunc coriander|200 g Dried chickpeas; soaked overnight and cooked or 400g/14oz tin cooked chickpeas, well drained|Finely grated zest and juice of 1 lemon|1/2 Red chilli; deseeded, finely chopped|250 g Tomatoes; deseeded, finely diced|1 ts Cinnamon|6 tb Extra virgin olive oil|2 Cloves garlic; crushed|Salt and pepper",
    "servings": "8 servings",
    "instructions": "1 Put the cracked wheat or couscous in a bowl with the saffron and pour over the water. Stir, leave for 20-30 minutes to swell and soften. Drain off any water that has not been absorbed. 2 Finely chop the leaves off the mint, parsley and coriander. Mix into the cracked wheat or couscous with the remaining ingredients, cover and chill in the fridge for a few hours or overnight, to allow the flavours to blend, and the leaves to soften. 3 Stir again, taste and adjust the seasoning. Serve as a first course with good bread, or as an accompaniment."
  },
  {
    "title": "Middle Eastern Lamb And Courgette Gratin",
    "ingredients": "1 Onion; sliced|1 Garlic cloves; chopped finely, up to 2|3 tb Olive oil|1/4 ts Ground cinnamon|1/4 ts Allspice|300 g Minced lamb; (10oz)|1 397 gram can chopped tomatoes; (14oz)|300 g Courgettes; sliced (10oz)|175 g Conchiglie; (6oz)|50 g Parmesan cheese; grated (2oz)|Salt and pepper",
    "servings": "4 servings",
    "instructions": "1. Preheat the oven to Gas Mark 6/200 øC/400 øF. 2. Fry the onion and garlic in the oil for 5 minutes. 3. Add the spices and cook for 1 minute. 4. Add the lamb and cook for 5 minutes. 5. Add the tomatoes and courgettes and season. 6. Simmer for 10 minutes. 7. Cook the pasta in boiling salted water, according to the packet instructions. 8. Drain. 9. Mix the pasta with the meat mixture and transfer to a 1.2 litre (2 pint) greased ovenproof dish. 10. Sprinkle with the grated parmesan. 11. Bake in the oven for 10 minutes. 12. Brown under a hot grill for 2-3 minuets before serving. NOTES : A delicious Eastern pasta dish."
  },
  {
    "title": "Middle Eastern Roast Lamb or Turkey (Shawarma)",
    "ingredients": "2 Cloves garlic; crushed|1 tb Salt|1/2 ts Ground black pepper|1/2 ts Ground cinnamon or cumin|1/8 ts Grated nutmeg|1/8 ts Ground cloves|1 pn Cayenne pepper|1/4 c Water|2 tb Fresh lemon juice|1 tb White vinegar|1 Olive oil|1 sm Onion; chopped, (about 1/4 cup)|1/2 Lemon; sliced|5 lb Lamb shoulder or turkey; cut into 1/4-inch-thick slices",
    "servings": "10 Servings",
    "instructions": "1. Combine the garlic, salt, black pepper, cinnamon, nutmeg, cloves, and cayenne. Stir in the water, lemon juice, vinegar, oil, onion and lemon slices. Rub the marinade over the meat, place in the refrigerator and let stand overnight. 2. Remove meat from the refrigerator and let come to room temperature. 3. Preheat an outdoor grill, preferable with a rotisserie, or an electric rotisserie. 4. Stack the slices of meat, placing the larger pieces on the bottom, on a spit. Place the spit on the rotisserie or grill and roast. 5. As the exterior of the meat browns, slice it off across the outside, cutting through all the layers to create shreds. Return the spit to the grill and continue browning and slicing the cooked meat. Wrap the strips of meat in lavash or stuff into a pita, adding, if desired, any combination of shredded lettuce, chopped tomatoes, chopped onions and pitted olives."
  },
  {
    "title": "Swordfish Steaks W/middle Eastern Flavor",
    "ingredients": "2 8 oz. swordfish steaks; about 3/4-inch thick|2 tb Finely chopped fresh parsley (up to)|2 Minced Jalapeno or other hot peppers (chile heads see note; below)!|4 ts Vegetable oil|3 tb Fresh lemon juice|1 Clove garlic; minced|1 ts Ground turmeric|1 ts Ground cinnamon|1 ts Ground cumin|Salt and freshly ground black pepper to taste",
    "servings": "2 Servings",
    "instructions": "(adapted from Eating Well magazine) Place swordfish steaks in a shallow glass dish. In a small bowl, combine all remaining ingredients. Spread mixture over both sides of fish. Cover and refrigerate for 1 hour. Prepare a charcoal fire or preheat gas grill. Once the fire is at medium heat, grill the steaks for 4 to 5 minutes per side. The flesh should be opaque. Remove from the grill. Cut each steak into two portions and serve. Serves 4. 167 calories per serving: 19 G protein, 9 G fat, 3 G carbohydrate, 89 MG sodium, 38 mg cholesterol. Dots notes: I've made this using swordfish or yellowfin tuna. I always double the number of hot peppers (usually several large jalapenos or lots of small serranos) and the garlic. I serve this with Chardonnay or Sauvignon Blanc, vegetable, salad or slaw, & couscous or rice. Try to avoid getting the turmeric on the counter top (it stains)! Enjoy!"
  },
  {
    "title": "Ful (Middle Eastern Fava Bean Salad)",
    "ingredients": "1 lb (about 2 cups) dried fava beans (see Note below)|3 qt Water|1/3 c Olive or vegetable oil|1 ts Salt, about|Ground black pepper to taste|6 lg Eggs in shell, washed well (up to 8)|1/4 c Lemon juice, about|1/3 c Chopped fresh parsley",
    "servings": "6 To 8",
    "instructions": "The World Of Jewish Cooking, Gil Marks Ful is the Arabic word for 'fava beans'. This dish is also called salat lubiya (bean salad). Although fava bean salads, inexpensive and flavorful, are commonplace throughout the Near East and North Africa, the eggs are a distinctive Jewish touch. Serve ful as a salad, side dish, or part of a meze (appetizer assortment). Soak the beans in water to cover overnight. Drain. Place the beans in a 4-quart saucepan and add the 3 quarts of water. Bring to a boil, cover, reduce the heat to medium, stirring occasionally for 30 minutes. Stir in the oil, salt, and pepper. Add the eggs. Reduce the heat to low and simmer, stirring occasionally and adding ore water if necessary, until the beans are very tender,about 2 hours. Remove the eggs, peel, and chop or quarter. Add the lemon juice and parsley to the beans, tossing to coat. Divide among serving bowls and top with the eggs. Serve warm or chilled. Note: Dried fava beans are available in Middle Eastern and Italian groceries and in some specialty food stores. Since fava beans are sometimes hard to find, dried white beans, large dried lima beans, or chickpeas can be substituted. VARIATIONS: PUL MEDAMES (Sephardic Baked Fava Beans Cook the beans and eggs, covered, overnight over very lowheat and serve on Sabbath morning for desayuno (breakfast)). When simmered overnight this dish becomes a Sabbath stew similar to hamin. SYRIAN FUL Add 1-1/2 teaspoons ground cumin and 1/4 to 1/2 teaspoon hot red pepper flakes or a pinch of cayenne. YEMENITE FUL Spoon 2 tablespoons tarator bi tahina (sesame seed sauce) over each serving of beans. Note: To make tarator bi tahina (yield 1-1/3 cups)"
  },
  {
    "title": "Middle Eastern Bean and Roasted Vegetable Salad (Mf)",
    "ingredients": "15 oz Chick peas and small red kidney beans|2 c Couscous|2 1/2 c Salted boiling water|2 tb Tahini paste|1 Clove garlic, minced|1 ts Ground cumin|1 ts Ground coriander|1/2 c Plain nonfat yogurt|1/2 c Packed parsley leaves|1 tb Olive oil|1 ts Grated lemon zest|2 tb Lemon juice|Salt and freshly ground black pepper|1/2 c Walnuts, toasted and chopped|Mixed greens such as: torn escarole, watercress and boston lettuce, lightly tossed with a salad dressing of choice|Grilled or roasted vegetables to taste, roughly chopped|1/2 c Roasted peppers, cut into a fine julienne",
    "servings": "6 Servings",
    "instructions": "Chill the chick peas and beans for as long as possible. Steep couscous in boiling salted water. In a blender or food processor or by hand, blend until smooth the tahini paste, garlic, cumin, coriander, lowfat yogurt, parsley, olive oil, grated lemon zest and juice. Season to taste with salt and pepper and transfer to a mixing bowl. Add the chilled beans to the dressing and walnuts. Fluff up the couscous with a fork and add to beans and walnuts; toss the ingredients together and adjust the seasoning. On each dinner plate make an outer wreath of dressed greens, an inner wreath of mixed grilled vegetables of choice and center couscous and chick peas in the middle. Garnish top with roasted red peppers"
  },
  {
    "title": "Middle Eastern Black Bean Salad",
    "ingredients": "----SALAD------|3 1/2 c Cooked, Drained Black Beans|(1 cup dry)|1/2 c Red Onion -- finely diced|1 lg Tomato -- seeded and diced|1 sm Green Pepper -- seeded and|Diced|1 md Cucumber -- seeded and|Diced|1/2 c Chopped Parsley|1 tb Chopped Fresh Mint ----DRESSING------|1/4 c Lemon Juice|1 ts Cumin|1/4 ts Salt -- (or to taste)|1/4 ts Pepper|1/4 c Olive Oil",
    "servings": "6 Servings",
    "instructions": "Combine salad ingredients together and toss lightly. For dressing, add spices to the lemon juice and beat in oil. Pour over salad and chill for several hours. :"
  },
  {
    "title": "Middle Eastern Carrot Salad",
    "ingredients": "4 c Grated carrots|3 tb Fresh lemon juice|3 tb Vegetable oil|1/2 ts Ground coriander|1/4 ts Salt|2 ts Chopped fresh mint|1 tb Chopped fresh parsley|1 ts Sugar or maple syrup",
    "servings": "4 Servings",
    "instructions": "Mix all ingredients together & chill at least one hour before serving."
  }
